# Сортировка выбором

**Ограничение времени:** 1 с  
**Ограничение памяти:** 256.0 Мб  
**Ввод:** стандартный ввод или `input.txt`  
**Вывод:** стандартный вывод или `output.txt`

Реализуйте **сортировку выбором**.

Алгоритм сортировки выбором:
- На каждом шаге находится **минимальный элемент** в неотсортированной части массива.
- Этот элемент **меняется местами** с первым элементом неотсортированной части.
- Процесс повторяется, пока весь массив не будет отсортирован.

## Формат ввода

- В первой строке задано число $n$ ($1 \leq n \leq 1000$).
- Во второй строке задано $n$ целых чисел $a_i$ ($1 \leq a_i \leq 10^9$).

## Формат вывода

Выведите отсортированный по возрастанию массив чисел через пробел.

## Примеры

### Пример 1

**Ввод:**
```
7
13 17 37 73 31 19 23
```

**Вывод:**
```
13 17 19 23 31 37 73
```

### Пример 2

**Ввод:**
```
6
12 18 7 11 5 17
```

**Вывод:**
```
5 7 11 12 17 18
```

### Пример 3

**Ввод:**
```
3
1 2 3
```

**Вывод:**
```
1 2 3
```
## Решение

main.cpp
```cpp
#include <iostream>
#include <vector>


void sortingByChoice(std::vector<int> & vec) {
    for (size_t i = 0; i < vec.size(); ++i) {
        int minIndex = i;
        for (size_t j = i + 1; j < vec.size(); ++j) {
            if (vec[j] < vec[minIndex]) {
                minIndex = j;
            }
        }    
        std::swap(vec[i], vec[minIndex]);
    }
    
    return;
}

int main() {
    int n;
    std::cin >> n;
    std::vector<int> vec(n);

    for (int i = 0; i < n; ++i) {
        std::cin >> vec[i];
    }
    
    sortingByChoice(vec);

    for (int i = 0; i < n; ++i) {
        if (i > 0) std::cout << ' ';
        std::cout << vec[i];
    }
    std::cout << '\n';

    return 0;
}
```
