# Вычисление арифметического выражения без скобок

**Ограничение времени:** 1 с  
**Ограничение памяти:** 256.0 Мб  
**Ввод:** стандартный ввод или `input.txt`  
**Вывод:** стандартный вывод или `output.txt`

## Условие задачи

Дана строка $s$ длиной не более 20 символов, представляющая арифметическое выражение, состоящее из:
- **целых чисел** от `0` до `99`,
- бинарных операций: `+`, `-`, `*`.

Выражение **не содержит скобок**, и его необходимо вычислить **с учётом стандартного приоритета операций**:
1. Умножение (`*`) выполняется **до** сложения и вычитания.
2. Сложение (`+`) и вычитание (`-`) выполняются **слева направо**.

## Формат ввода

Единственная строка — корректное арифметическое выражение.

**Ограничения:**  
- Длина строки ≤ 20 символов,
- Все числа — целые в диапазоне от 0 до 99,
- Выражение начинается с числа и чередуется: число → операция → число → … → число.

## Формат вывода

Выведите одно целое число — результат вычисления выражения с учётом приоритета операций.

## Примеры

### Пример 1

**Ввод:**
```
5-8+7*4-8+9
```

**Вывод:**
```
26
```

### Пример 2

**Ввод:**
```
23*17-18+37
```

**Вывод:**
```
410
```

### Пример 3

**Ввод:**
```
1+1+4+0-0*0+15
```

**Вывод:**
```
21
```
## Решение

main.cpp
```cpp
#include <iostream>
#include <string>

int main() {
    std::string s;
    std::cin >> s;

    long long result = 0;
    long long last = 0;
    long long current = 0;
    char op = '+'; // начальная операция

    for (int i = 0; i <= (int)s.size(); ++i) {
        char c = (i < (int)s.size()) ? s[i] : '+'; // фиктивная операция в конце

        if (isdigit(c)) {
            current = current * 10 + (c - '0');
        } else {
            if (op == '+') {
                result += current;
                last = current;
            } else if (op == '-') {
                result -= current;
                last = -current;
            } else if (op == '*') {
                result = result - last + last * current;
                last = last * current;
            }
            op = c;
            current = 0;
        }
    }

    std::cout << result << '\n';
    return 0;
}
```
