# Поиск доминирующего элемента

**Ограничение времени:** 1 с  
**Ограничение памяти:** 256.0 Мб  
**Ввод:** стандартный ввод или `input.txt`  
**Вывод:** стандартный вывод или `output.txt`

## Условие задачи

Дана последовательность из $n$ целых неотрицательных чисел.  
Требуется определить, существует ли в ней **доминирующий элемент** — то есть элемент, который встречается **более чем в половине позиций**, то есть **строго больше** $\frac{n}{2}$ раз.

## Формат ввода

- Первая строка: целое число $n$ — длина последовательности.  
- Вторая строка: $n$ целых чисел $a_0, a_1, \dots, a_{n-1}$.

**Ограничения:**  
$1 \leq n \leq 10^5$,  
$0 \leq a_i \leq 10^9$ для всех $0 \leq i < n$.

## Формат вывода

Выведите:
- `1`, если в последовательности существует элемент, встречающийся **более** $\frac{n}{2}$ раз,
- `0` — в противном случае.

## Примеры

### Пример 1

**Ввод:**
```
5
2 3 9 2 2
```

**Вывод:**
```
1
```

### Пример 2

**Ввод:**
```
4
1 2 3 1
```

**Вывод:**
```
0
```
## Решение

main.cpp
```cpp
#include <iostream>
#include <vector>

int main() {
    int n;
    std::cin >> n;
    std::vector<int> a(n);
    
    for (int i = 0; i < n; ++i) {
        std::cin >> a[i];
    }

    int candidate = -1;
    int count = 0;
    for (int x : a) {
        if (count == 0) {
            candidate = x;
            count = 1;
        } else if (x == candidate) {
            ++count;
        } else {
            --count;
        }
    }
    int freq = 0;
    for (int x : a) {
        if (x == candidate) ++freq;
    }

    std::cout << (freq > n / 2 ? 1 : 0) << '\n';
    return 0;
}
```
