# Встречалось ли число раньше?

**Ограничение времени**: 1 с  
**Ограничение памяти**: 64.0 Мб  
**Ввод**: стандартный ввод или `input.txt`  
**Вывод**: стандартный вывод или `output.txt`

---

## Задание

На вход подаётся последовательность целых чисел.  
Для каждого числа выведите в отдельной строке:

- `YES` — если это число **уже встречалось ранее** в последовательности,
- `NO` — если **встречается впервые**.

---

## Формат ввода

- Вводится **одна строка**, содержащая целые числа, разделённые пробелом.
- Все числа представимы типом `int`.

---

## Формат вывода

Для каждого числа из входной последовательности — вывести в отдельной строке `YES` или `NO`.

---

## Пример

**Ввод:**
```text
1 2 1 2 2 1 6
```

**Вывод:**
```text
NO
NO
YES
YES
YES
YES
NO
```

## Примечание

Напишите **полную программу**, читающую из `std::cin` и пишущую в `std::cout`.  
Используйте `std::set` или `std::unordered_set` для эффективного отслеживания уже встреченных чисел.
## Решение

main.cpp
```cpp
#include <iostream>
#include <unordered_set>

int main() {
    int n;
    std::unordered_set<int> sequence;
    while (std::cin >> n) {
        const auto & [iter, has_insert] = sequence.insert(n);
        std::cout << (has_insert ? "NO" : "YES") << '\n';
    }
    return 0;
}
```
