# Наибольший общий делитель

**Ограничение времени:** 1 с  
**Ограничение памяти:** 256.0 Мб  
**Ввод:** стандартный ввод или `input.txt`  
**Вывод:** стандартный вывод или `output.txt`

Для двух чисел $a$ и $b$ найдите их наибольший общий делитель.

## Формат ввода

Целые числа $a$ и $b$ (разделённые пробелом).

**Ограничения:**  
$$
1 \leq a, b \leq 2 \cdot 10^9
$$

## Формат вывода

Наибольший общий делитель чисел $a$ и $b$.

## Примеры

### Пример 1

**Ввод**  
```
18 35
```

**Вывод**  
```
1
```

### Пример 2

**Ввод**  
```
28851538 1183019
```

**Вывод**  
```
17657
```
## Решение

main.cpp
```cpp
#include <iostream>

template <typename T>
T GCD(T lhs, T rhs) {
    if (lhs < rhs) {
        std::swap(lhs, rhs);
    }

    if (rhs == 0) {
        return lhs;
    }

    return GCD(lhs % rhs, rhs);
}

int main() {
    unsigned int a, b;
    std::cin >> a >> b;
    std::cout << GCD(a, b) << '\n';
    return 0;
}
```
