# A+B строки

**Ограничение времени:** 1 с  
**Ограничение памяти:** 256.0 Мб  
**Ввод:** стандартный ввод или `input.txt`  
**Вывод:** стандартный вывод или `output.txt`

Необходимо вычислить **«кривую» сумму** двух строк $ A $ и $ B $ одинаковой длины $ n $.

## Определение «кривой» суммы

Результат — новая строка $ C $, построенная по следующему правилу:

$$
C = A_1 B_1 A_2 B_2 \dots A_n B_n
$$

То есть символы строк $ A $ и $ B $ **чередуются попарно**: сначала первый символ из $ A $, затем первый из $ B $, потом второй из $ A $, второй из $ B $, и так далее.

---

## Формат ввода

- Первая строка: целое число $ n $ ($ 1 \leq n \leq 10 $) — длина строк.
- Вторая строка: строка $ A $, состоящая из строчных латинских букв (`a`–`z`).
- Третья строка: строка $ B $, также из строчных латинских букв.

Гарантируется, что длины строк равны $ n $.

## Формат вывода

Выведите одну строку — результат «кривой» суммы $ C = A + B $.

---

## Примеры

### Пример 1

**Ввод:**
```
3
abc
def
```

**Вывод:**
```
adbecf
```

### Пример 2

**Ввод:**
```
5
abaca
bdaef
```

**Вывод:**
```
abbdaaceaf
```

### Пример 3

**Ввод:**
```
1
y
z
```

**Вывод:**
```
yz
```
## Решение

main.cpp
```cpp
#include <iostream>
#include <string>

int main() {
    int n;
    std::cin >> n;
    std::string A, B;
    std::cin >> A >> B;
    for (int i = 0; i < n; ++i) {
        std::cout << A[i] << B[i];
    }
    std::cout << '\n';
    return 0;
}
```
