# Покрытие точек отрезками одинаковой длины

**Ограничение времени:** 1 с  
**Ограничение памяти:** 256.0 Мб  
**Ввод:** стандартный ввод или `input.txt`  
**Вывод:** стандартный вывод или `output.txt`

Заданы $n$ точек на прямой.  
Требуется найти **наименьшее количество отрезков длины $L$**, которые **покрывают все точки**.

> Отрезок длины $L$ может начинаться в любой точке вещественной прямой.  
> Точка считается покрытой, если она лежит **внутри или на границе** отрезка.

## Формат ввода

- Первая строка: два целых числа $n$ и $L$  
  ($1 \leq n \leq 10^5$, $1 \leq L \leq 10^9$).
- Вторая строка: $n$ целых чисел $x_i$ — координаты точек  
  ($-10^9 \leq x_i \leq 10^9$).

## Формат вывода

Выведите одно целое число — **минимальное количество отрезков длины $L$**, необходимых для покрытия всех точек.

## Примеры

### Пример 1

**Ввод:**
```
5 4
1 1 3 4 5
```

**Вывод:**
```
1
```

### Пример 2

**Ввод:**
```
5 1
1 2 3 4 5
```

**Вывод:**
```
3
```

### Пример 3

**Ввод:**
```
6 2
1 2 3 4 5 6
```

**Вывод:**
```
2
```
## Решение

main.cpp
```cpp
#include <iostream>
#include <vector>
#include <algorithm>

int main() {
    int n, L;
    std::cin >> n >> L;
    std::vector<int> x(n);
    for (int i = 0; i < n; ++i) {
        std::cin >> x[i];
    }
    std::sort(x.begin(), x.end());
    int answer = 1;
    long long lastEnd = x[0] + L;
    for (int i = 1; i < n; ++i) {
        if (x[i] <= lastEnd) {
            continue;
        }

        ++answer;
        lastEnd = x[i] + L;
    }

    std::cout << answer << '\n';
    
    return 0;
}
```
