# Максимальный оклад

**Ограничение времени:** 1 с  
**Ограничение памяти:** 256.0 Мб  
**Ввод:** стандартный ввод или `input.txt`  
**Вывод:** стандартный вывод или `output.txt`

В качестве последнего вопроса на собеседовании будущий начальник даёт вам $n$ бумажек с одним числом на каждой и просит **составить из них самое большое число**.  
Получившееся число — ваша зарплата, поэтому вы очень замотивированы решить эту задачу!

> Числа можно **переставлять в любом порядке**, но **нельзя разбивать** или изменять их цифры.

## Формат ввода

- Первая строка: целое число $n$ ($1 \leq n \leq 100$).
- Вторая строка: $n$ целых чисел $a_1, a_2, \dots, a_n$ ($1 \leq a_i \leq 10^3$).

## Формат вывода

Выведите **самое большое возможное число**, которое можно составить, **конкатенируя** данные числа в подходящем порядке.

> Ответ может быть очень длинным — его следует выводить как строку (без пробелов и разделителей).

## Примеры

### Пример 1

**Ввод:**
```
2
21 2
```

**Вывод:**
```
221
```

### Пример 2

**Ввод:**
```
5
9 4 6 1 9
```

**Вывод:**
```
99641
```

### Пример 3

**Ввод:**
```
3
23 39 92
```

**Вывод:**
```
923923
```
## Решение

main.cpp
```cpp
#include <iostream>
#include <vector>
#include <algorithm>

int main() {
    int n;
    std::cin >> n;
    std::vector<std::string> numbers(n);
    for (int i = 0; i < n; ++i) {
        std::cin >> numbers[i];
    }
    std::sort(numbers.begin(), numbers.end(), [](const auto & lhs, const auto & rhs){
        return (lhs + rhs > rhs + lhs);
    });

    for (const auto & number : numbers) {
        std::cout << number;
    }
    std::cout << '\n';

    return 0;
}
```
