# Сумма цифр

## Ограничения

| Параметр             | Значение            |
|----------------------|---------------------|
| Ограничение времени  | 1 секунда           |
| Ограничение памяти   | 64.0 Мб             |
| Ввод                 | стандартный ввод или `input.txt` |
| Вывод                | стандартный вывод или `output.txt` |

---

## Условие задачи

Вычислите сумму цифр неотрицательного целого числа.

### Формат ввода

На вход подаётся одно неотрицательное целое число, не превосходящее \(10^9\).

### Формат вывода

Выведите сумму цифр этого числа.

---

## Пример

Ввод:
```
59
```

Вывод:
```
14
```
## Решение

main.cpp
```cpp
#include <iostream>
#include <numeric>

int main() {
    std::string number;
    std::cin >> number;
    std::cout << std::accumulate(number.begin(), number.end(), 0, [](int acc, const char & lhs) {
        return acc + (lhs - '0');
    }) << '\n';
    return 0;
}
```
