# Рекламная кампания

**Ограничение времени:** 2 с  
**Ограничение памяти:** 256.0 Мб  
**Ввод:** стандартный ввод или `input.txt`  
**Вывод:** стандартный вывод или `output.txt`

У вас есть популярная страница в интернете, на которой есть $n$ рекламных мест.  
Аналитики прогнозируют, что эти места получат соответственно  
$clicks_1, clicks_2, \dots, clicks_n$ кликов в день.

С вами связались $n$ рекламодателей, каждый из которых готов заплатить  
$price_1, price_2, \dots, price_n$ **за один клик**.

Каждому рекламному месту можно сопоставить **ровно одного** рекламодателя, и наоборот.  
Прибыль от назначения рекламодателя с ценой $price_i$ на место с $clicks_j$ кликами равна $price_i \cdot clicks_j$.

Требуется **назначить рекламодателей на места** так, чтобы **суммарная прибыль была максимальной**.


## Формат ввода

- Первая строка: целое число $n$.
- Вторая строка: $n$ целых чисел $price_1, \dots, price_n$.
- Третья строка: $n$ целых чисел $clicks_1, \dots, clicks_n$.

**Ограничения:**
- $1 \leq n \leq 10^3$
- $0 \leq price_i, clicks_i \leq 10^5$

## Формат вывода

Выведите одно целое число — **максимальную возможную прибыль**.

## Примеры

### Пример 1

**Ввод:**
```
1
23
39
```

**Вывод:**
```
897
```

### Пример 2

**Ввод:**
```
3
2 3 9
7 4 2
```

**Вывод:**
```
79
```
## Решение

main.cpp
```cpp
#include <iostream>
#include <vector>
#include <algorithm>

int main() {
    int n;
    std::cin >> n;
    std::vector<int> prices(n), clicks(n);
    for (int i = 0; i < n; ++i) {
        std::cin >> prices[i];
    }
    std::sort(prices.begin(), prices.end(), std::greater<int>());
    for (int i = 0; i < n; ++i) {
        std::cin >> clicks[i];
    }
    std::sort(clicks.begin(), clicks.end(), std::greater<int>());
    long long answer = 0;
    for (int i = 0; i < n; ++i) {
        answer += 1ll * prices[i] * clicks[i];
    }

    std::cout << answer << '\n';
    return 0;
}
```
