# Минимальная длина покрывающих отрезков

**Ограничение времени:** 1 с  
**Ограничение памяти:** 256.0 Мб  
**Ввод:** стандартный ввод или `input.txt`  
**Вывод:** стандартный вывод или `output.txt`

## Условие задачи

Заданы $n$ точек на координатной прямой. Требуется покрыть **все точки** ровно $k$ отрезками **одинаковой длины**.

Отрезок покрывает точку, если она лежит **внутри** отрезка или на его границе.  
Длина отрезка — это разность между его правым и левым концами.

Необходимо найти **минимально возможную длину** таких отрезков.

## Формат ввода

- Первая строка: два целых числа $n$ и $k$ — количество точек и количество отрезков соответственно.  
- Вторая строка: $n$ целых чисел $x_1, x_2, \dots, x_n$ — координаты точек.

**Ограничения:**  
$1 \leq n, k \leq 10^5$,  
$1 \leq x_i \leq 10^9$.

## Формат вывода

Выведите одно целое число — **минимальную возможную длину** каждого из $k$ отрезков, достаточную для покрытия всех точек.

## Примеры

### Пример 1

**Ввод:**
```
5 3
2 3 9 11 20
```

**Вывод:**
```
2
```

### Пример 2

**Ввод:**
```
5 2
2 3 9 11 20
```

**Вывод:**
```
9
```

### Пример 3

**Ввод:**
```
4 2
1 2 1 2
```

**Вывод:**
```
0
```
## Решение

main.cpp
```cpp
#include <iostream>
#include <vector>
#include <algorithm>
#include <numeric>


bool enough(const std::vector<int> & x, int k, int curLength) {
    int curEnd = x.front() - 1;
    for (size_t i = 0; i < x.size(); ++i) {
        if (x[i] <= curEnd) {
            continue;
        }

        curEnd = x[i] + curLength;
        --k;
    }

    return (k >= 0);
}

int main() {
    int n, k;
    std::cin >> n >> k;
    std::vector<int> x(n);
    for (int i = 0; i < n; ++i) {
        std::cin >> x[i];
    }
    if (k >= n) {
        std::cout << "0\n";
        return 0;
    }

    std::sort(x.begin(), x.end());

    int l = 0, r = x.back() - x.front();
    while (l < r) {
        int m = (l + r) / 2;
        if (enough(x, k, m)) {
            r = m;
        } else {
            l = m + 1;
        }
    }

    std::cout << l << '\n';

    return 0;
}
```
