# Файловая система

**Ограничение времени**: 1 с  
**Ограничение памяти**: 64.0 Мб  
**Ввод**: стандартный ввод или `input.txt`  
**Вывод**: стандартный вывод или `output.txt`

---

## Задание

Дан список всех файлов в некоторой файловой системе.  
Необходимо вывести **все непустые директории** этой файловой системы **в лексикографическом порядке**.

---

## Правила

- Все пути начинаются от **корня** (`/`).
- Пути состоят из: `/`, латинских букв, цифр, точек.
- Два слеша **никогда не идут подряд**.
- Директория считается **непустой**, если в ней (прямо или через поддиректории) есть хотя бы один файл.
- Выводить нужно **все директории**, в которые ведёт путь к какому-либо файлу — включая промежуточные.

---

## Формат ввода

- На вход подаются строки — **пути к файлам**, по одному в строке.
- Число строк ≤ 10000.

---

## Формат вывода

- Вывести все **непустые директории** в **лексикографическом порядке**.
- Каждый путь должен:
  - **Начинаться со слеша** — `/`
  - **Заканчиваться слешом** — `/`
- Корневая директория `/` всегда выводится, если есть хотя бы один файл.

---

## Пример 1

**Ввод:**
```text
/docs/README.txt
/docs/LICENSE.txt
/boot/grub
/init
```

**Вывод:**
```text
/
/boot/
/docs/
```

---

## Пример 2

**Ввод:**
```text
/home/guest/homework/A/main.cpp
/root/test.cpp
/root/tests/01
/root/tests/01.a
/bin/bash
/usr/bin/perl
```

**Вывод:**
```text
/
/bin/
/home/
/home/guest/
/home/guest/homework/
/home/guest/homework/A/
/root/
/root/tests/
/usr/
/usr/bin/
```

---

## Примечание

Напишите **полную программу**, читающую из `std::cin` и пишущую в `std::cout`.  
Используйте `std::set<std::string>` для автоматической сортировки и исключения дубликатов.


## Решение

main.cpp
```cpp
#include <iostream>
#include <string>
#include <set>

int main() {
    std::string path;
    std::set<std::string> answer;
    while (std::cin >> path) {
        size_t lastSlash = 0;
        while ((lastSlash  = path.find('/', lastSlash)) != std::string::npos) {
            ++lastSlash;
            answer.insert(path.substr(0, lastSlash));
        }
    }

    for (const std::string & elem : answer) {
        std::cout << elem << '\n';
    }

    return 0;
}
```
