# Корпоративные связи

**Ограничение времени:** 1 с  
**Ограничение памяти:** 64.0 Мб  
**Ввод:** стандартный ввод или `input.txt`  
**Вывод:** стандартный вывод или `output.txt`

В компании работают сотрудники, распределённые по отделам.  
Каждый отдел задаётся начальником и списком его подчинённых.

Связь в графе определяется так: для каждого отдела между начальником и каждым его подчинённым проводится ориентированное ребро от начальника к подчинённому.

Постройте общий граф всех корпоративных связей и выведите его в виде матрицы смежности.

## Формат входных данных

Первая строка содержит целое число $d$ — количество отделов ($1 \leq d \leq 100$).

Далее следуют $d$ строк. Каждая строка описывает один отдел в формате:  
```
k начальник работник_1 работник_2 ... работник_k
```  
где  
- $k$ — количество сотрудников в отделе (включая начальника),  
- все идентификаторы сотрудников — целые числа в диапазоне $[1; n]$,  
- $n$ — общее количество работников ($2 \leq n \leq 100$).

Гарантируется, что в каждой строке начальник указан ровно один раз, а список подчинённых непустой и без повторов.

## Формат выходных данных

Выведите матрицу смежности размером $n \times n$.  
Строки и столбцы соответствуют работникам с номерами от $1$ до $n$.

- Если работник $i$ является начальником для работника $j$, то $A[i][j] = 1$.  
- Если работник $j$ является начальником для работника $i$, то $A[i][j] = -1$.  
- Если прямой связи нет, то $A[i][j] = 0$.

## Примеры

### Пример 1

**Ввод**  
```
2
3 1 2 3
2 4 5
```

**Вывод**  
```
0 1 1 0 0
-1 0 0 0 0
-1 0 0 0 0
0 0 0 0 1
0 0 0 -1 0
```

### Пример 2

**Ввод**  
```
4
3 1 2 3
3 2 4 5
3 3 6 7
3 4 8 9
```

**Вывод**  
```
0 1 1 0 0 0 0 0 0
-1 0 0 1 1 0 0 0 0
-1 0 0 0 0 1 1 0 0
0 -1 0 0 0 0 0 1 1
0 -1 0 0 0 0 0 0 0
0 0 -1 0 0 0 0 0 0
0 0 -1 0 0 0 0 0 0
0 0 0 -1 0 0 0 0 0
0 0 0 -1 0 0 0 0 0
```
## Решение

main.cpp
```cpp
#include <iostream>
#include <vector>

template <typename T>
using row = std::vector<T>;

template <typename T>
using matrix = std::vector<row<T>>;

template <typename T>
std::ostream & operator<<(std::ostream & os, const matrix<T> & rhs) {
    for (size_t i = 0; i < rhs.size(); ++i) {
        for (size_t j = 0; j < rhs[0].size(); ++j) {
            if (j > 0) os << ' ';
            os << rhs[i][j];
        }
        os << '\n';
    }
    return os;
}

int main() {
    std::ios::sync_with_stdio(false);
    std::cin.tie(0);

    int d, n = 0;
    std::cin >> d;
    matrix<int> graph(100, row<int>(100, 0));
    for (int i = 0; i < d; ++i) {
        int k;
        std::cin >> k;
        int chief;
        std::cin >> chief;
        n = std::max(n, chief);
        for (int j = 1; j < k; ++j) {
            int worker;
            std::cin >> worker;
            n = std::max(n, worker);
            graph[chief - 1][worker - 1] = 1;
            graph[worker - 1][chief - 1] = -1;
        }
    }

    for (int i = 0; i < n; ++i) {
        for (int j = 0; j < n; ++j) {
            if (j > 0) std::cout << ' ';
            std::cout << graph[i][j];
        }
        std::cout << '\n';
    }

    return 0;   
}


```
