# Диофантово уравнение

**Ограничение времени:** 1 с  
**Ограничение памяти:** 64.0 Мб  
**Ввод:** стандартный ввод или `input.txt`  
**Вывод:** стандартный вывод или `output.txt`

Даны три целых числа $a$, $b$ и $c$. Необходимо проверить, существует ли решение в целых числах $(x, y)$ уравнения:

$$
a \cdot x + b \cdot y = c.
$$

## Формат входных данных

Первая строка содержит три целых числа $a$, $b$, $c$.

**Ограничения:**  
$$
-10^9 \leq a, b, c \leq 10^9
$$

## Формат выходных данных

Выведите `YES`, если существуют целые $x$ и $y$, удовлетворяющие уравнению.  
Иначе выведите `NO`.

## Примеры

### Пример 1

**Ввод**  
```
6 9 3
```

**Вывод**  
```
YES
```

### Пример 2

**Ввод**  
```
5 -11 4
```

**Вывод**  
```
YES
```
## Решение

main.cpp
```cpp
#include <iostream>
#include <numeric>


int main() {
    int a, b, c;
    std::cin >> a >> b >> c;
    std::cout << (c % std::gcd(a, b) == 0 ? "YES" : "NO") << '\n';
    return 0;
}
```
