# Огромное число Фибоначчи

**Ограничение времени:** 3 с  
**Ограничение памяти:** 256.0 Мб  
**Ввод:** стандартный ввод или `input.txt`  
**Вывод:** стандартный вывод или `output.txt`

Даны целые числа $ n $ и $ m $. Требуется найти остаток от деления $ n $-го числа Фибоначчи на $ m $, то есть:

$$
F_n \bmod m
$$

## Определение чисел Фибоначчи

- $ F_0 = 0 $
- $ F_1 = 1 $
- $ F_n = F_{n-1} + F_{n-2} $ для $ n \geq 2 $

---

## Важные наблюдения

- Прямое вычисление $ F_n $ невозможно при $ n \leq 10^{14} $.
- Однако последовательность $ F_n \bmod m $ **периодична** — это **период Пизано**.
- Длина периода для модуля $ m $ не превышает $ 6m $ (и часто значительно меньше).
- Так как $ m \leq 10^3 $, максимальная длина периода ≤ 6000, что легко укладывается в память и время.

## Алгоритм

1. Найдите период Пизано для модуля $ m $:
   - Генерируйте последовательность $ F_i \bmod m $,
   - Ищите первое повторение пары `(0, 1)` — начало нового периода.
2. Пусть длина периода = $ \pi(m) $.
3. Вычислите $ r = n \bmod \pi(m) $.
4. Найдите $ F_r \bmod m $ — это и есть ответ.

---

## Формат ввода

Два целых числа $ n $ и $ m $:
- $ 1 \leq n \leq 10^{14} $
- $ 2 \leq m \leq 10^3 $

## Формат вывода

Одно целое число — $ F_n \bmod m $.

---

## Примеры

### Пример 1

**Ввод:**
```
1 239
```

**Вывод:**
```
1
```

### Пример 2

**Ввод:**
```
115 1000
```

**Вывод:**
```
885
```

### Пример 3

**Ввод:**
```
2816213588 239
```

**Вывод:**
```
151
```
## Решение

main.cpp
```cpp
#include <iostream>
#include <vector>

int main() {
    long long n, m;
    std::cin >> n >> m;    
    if (n == 0) {
        std::cout << n << '\n';
        return 0;
    }

    std::vector<int> pizano = {0, 1};

    int prev = 0, cur = 1;
    while (pizano.size() == static_cast<size_t>(2) || (prev != 0 || cur != 1)) {
        int tmp = prev;
        prev = cur;
        cur = (prev + tmp) % m;
        pizano.push_back(cur);
    }

    // Убираем 0 1 последние
    pizano.pop_back();
    pizano.pop_back();

    int period = static_cast<int>(pizano.size());

    std::cout << pizano[n % period] << '\n';
    return 0;
}
```
