# Инопланетный сигнал

**Ограничение времени:** 1 с  
**Ограничение памяти:** 64.0 Мб  
**Ввод:** стандартный ввод или `input.txt`  
**Вывод:** стандартный вывод или `output.txt`

Из далёкой галактики на Землю поступают последовательности, состоящие только из нулей и единиц.  
Учёные заметили, что техногенные сигналы имеют особенность: они содержат внутри себя определённую подпоследовательность $X$.

Вам дана строка $S$, состоящая из символов `0` и `1` — это сигнал, полученный радиотелескопом.  
Во второй строке ввода дана строка $X$ — шаблон, по которому учёные определяют техногенное происхождение сигнала.

Необходимо проверить, встречается ли последовательность $X$ внутри строки $S$ **как подстрока**.

## Формат входных данных

- Первая строка: строка $S$ (длина от $1$ до $10^5$), содержащая только символы `0` и `1`.
- Вторая строка: строка $X$ (длина от $1$ до $1000$), также состоящая только из `0` и `1`.

## Формат выходных данных

Выведите `YES`, если $X$ встречается как подстрока в $S$.  
Иначе выведите `NO`.

## Примеры

### Пример 1

**Ввод:**
```
10101011001
1011
```

**Вывод:**
```
YES
```

### Пример 2

**Ввод:**
```
000111000
0101
```

**Вывод:**
```
NO
```
## Решение

main.cpp
```cpp
#include <iostream>

int main() {
    std::string input, temp;
    std::cin >> input >> temp;
    std::cout << (input.find(temp) != std::string::npos ? "YES" : "NO") << '\n';
    return 0;
}
```
