# Удаление последнего максимума

**Ограничение времени:** 1 с  
**Ограничение памяти:** 256.0 Мб  
**Ввод:** стандартный ввод или `input.txt`  
**Вывод:** стандартный вывод или `output.txt`

Дан массив `a`, состоящий из `n` чисел.

Удалите элемент в самой правой (с наибольшим номером) позиции, содержащий **максимальный элемент массива**.

## Формат ввода

Первая строка содержит единственное число `n` — количество чисел в массиве.

Вторая строка содержит `n` чисел `a_i`, где `a_i` — число на `i`-й позиции в массиве `a`. Числа разделены пробелами.

**Ограничения:**  
`3 ≤ n ≤ 10^5`;  
`1 ≤ a_i ≤ 10^5` для всех `1 ≤ i ≤ n`.

## Формат вывода

Выведите `n − 1` число — оставшиеся элементы массива `a`. Числа разделяйте пробелами.

## Пример 1

Ввод:
```
5
3 2 5 1 4
```

Вывод:
```
3 2 1 4
```

## Пример 2

Ввод:
```
5
1 2 5 3 5
```

Вывод:
```
1 2 5 3
```

## Пример 3

Ввод:
```
7
1 2 1 2 1 2 1
```

Вывод:
```
1 2 1 2 1 1
```
## Решение

main.cpp
```cpp
#include <iostream>
#include <vector>


int main() {
    int n;
    std::cin >> n;
    std::vector<int> vec(n), maximum(n);
    for (int i = 0; i < n; ++i) {
        std::cin >> vec[i];
        
        if (i > 0) {
            maximum[i] = maximum[i - 1];
            if (vec[i] >= vec[maximum[i]]) {
                maximum[i] = i;
            }
        }
    }    
    vec.erase(vec.begin() + maximum.back());

    --n;
    for (int i = 0; i < n; ++i) {
        if (i > 0) std::cout << ' ';
        std::cout << vec[i];
    }
    std::cout << '\n';

    return 0;
}
```
