# Подключение

**Ограничение времени:** 1 с  
**Ограничение памяти:** 64.0 Мб  
**Ввод:** стандартный ввод или `input.txt`  
**Вывод:** стандартный вывод или `output.txt`

В офисе компании работает команда сотрудников, на каждом столе стоит компьютер, который необходимо подключить к сети. Столы расположены вдоль длинного коридора, каждый в определённой позиции на линии.

Каждый компьютер можно подключить одним из двух способов:
- **Напрямую к потолочным коммуникациям** — стоимость такого подключения равна $K$.
- **Через кабель к ближайшему соседу слева** — то есть к ближайшему компьютеру с меньшей координатой. Стоимость кабеля равна **квадрату расстояния** между этими двумя столами.

> Если у компьютера **нет соседа слева** (он самый левый), его можно подключить **только напрямую**.

Задача состоит в том, чтобы построить сеть так, чтобы **все компьютеры имели подключение к сети** (прямо или через цепочку кабелей влево) при **минимальной суммарной стоимости**.

## Формат входных данных

- В первой строке два натуральных числа:
  - $N$ — количество компьютеров ($2 \leq N \leq 10^4$),
  - $K$ — стоимость подключения одного компьютера к потолочным коммуникациям ($1 \leq K \leq 10^6$).
- Во второй строке указаны $N$ целых чисел $x_1, x_2, \dots, x_N$ — координаты компьютеров в **произвольном порядке** ($1 \leq x_i \leq 10^6$).

## Формат выходных данных

Одно число — **минимальная суммарная стоимость** сети.

## Примеры

### Пример 1

**Ввод:**
```
4 10
15 4 1 7
```

**Вывод:**
```
38
```

### Пример 2

**Ввод:**
```
5 10
11 1 20 6 2
```

**Вывод:**
```
41
```
## Решение

main.cpp
```cpp
#include <iostream>
#include <vector>
#include <algorithm>


int main() {
    int n, k;
    std::cin >> n >> k;
    std::vector<int> x(n);
    for (int i = 0; i < n; ++i) {
        std::cin >> x[i];
    }
    std::sort(x.begin(), x.end());
    std::vector<long long> dp(n, 0);
    dp[0] = k; // У самого левого нет вариантов кроме как присоединиться к потолочным коммуникациям
    for (size_t i = 1; i < x.size(); ++i) {
        dp[i] = dp[i - 1] + std::min(1ll * k, 1ll * (x[i] - x[i - 1]) * (x[i] - x[i - 1]));
    }

    std::cout << dp.back() << '\n';
    return 0;
}
```
