# Каноническая запись в системе Фибоначчи

**Ограничение времени:** 1 с  
**Ограничение памяти:** 64.0 Мб  
**Ввод:** стандартный ввод или `input.txt`  
**Вывод:** стандартный вывод или `output.txt`

## Условие задачи

Система Фибоначчи позволяет представлять целые числа в виде суммы **различных** чисел Фибоначчи.  
Однако одно и то же число может иметь несколько представлений. Чтобы устранить неоднозначность, используется **каноническая форма** — двоичная строка, в которой:

- Цифра `1` на позиции $i$ означает использование $i$-го числа Фибоначчи (нумерация начинается с $F_1 = 1$, $F_2 = 2$, $F_3 = 3$, $F_4 = 5$, и т.д., то есть **без дублирующей единицы** — часто используется последовательность $1, 2, 3, 5, 8, \dots$).
- **Никогда не встречаются две единицы подряд**.

Требуется по данному числу $N$ построить его каноническое представление в системе Фибоначчи.

## Формат входных данных

Целое число $N$ ($1 \leq N \leq 10^9$).

## Формат выходных данных

Строка из символов `0` и `1`, задающая каноническое представление числа $N$ в системе Фибоначчи.

## Примеры

### Пример 1

**Ввод**
```
5
```

**Вывод**
```
1000
```

---

### Пример 2

**Ввод**
```
11
```

**Вывод**
```
10100
```

## Решение

main.cpp
```cpp
#include <iostream>
#include <vector>

int main() {
    int n;
    std::cin >> n;
    std::vector<long long> canonical = {1, 1};
    while (n > canonical.back()) {
        int m = static_cast<int>(canonical.size());
        canonical.push_back(canonical[m - 1] + canonical[m - 2]);
    }

    if (canonical.back() > n) {
        canonical.pop_back();
    }

    int m = static_cast<int>(canonical.size());
    for (int i = m - 1; i > 0; --i) {
        if (n >= canonical[i]) {
            std::cout << '1';
            n -= canonical[i];
        } else {
            std::cout << '0';
        }
    }
    std::cout << '\n';

    return 0;
}
```
