# Расстояние редактирования

**Ограничение времени:** 1 с  
**Ограничение памяти:** 256.0 Мб  
**Ввод:** стандартный ввод или `input.txt`  
**Вывод:** стандартный вывод или `output.txt`

## Условие задачи

В вычислительной биологии есть множество применений задаче **«Редакционное расстояние»**: обработка текстов на естественном языке, проверка правописания и множество других сфер. Например, биологи зачастую вычисляют редакционное расстояние, когда ищут мутации, вызывающие болезни.

**Редакционное расстояние** между двумя строками определяется как **минимальное число односимвольных операций**, необходимых для преобразования одной строки в другую. Допустимые операции:
- **вставка** символа,
- **удаление** символа,
- **замена** символа.

## Формат ввода

Две отдельных строки, состоящие из строчных букв латинского алфавита.

**Ограничения:**  
Длина каждой строки — от $1$ до $100$ включительно.

## Формат вывода

Выведите одно целое число — редакционное расстояние между двумя заданными строками.

## Примеры

### Пример 1

**Ввод:**
```
abacab
bacacaba
```

**Вывод:**
```
3
```

### Пример 2

**Ввод:**
```
aaaaaac
caaaaaa
```

**Вывод:**
```
2
```

### Пример 3

**Ввод:**
```
ada
aba
```

**Вывод:**
```
1
```
## Решение

main.cpp
```cpp
#include <iostream>
#include <vector>
#include <algorithm>


int main() {
    std::string first, second;
    std::cin >> first >> second;
    std::vector<std::vector<int>> dp(first.size() + 1, std::vector<int>(second.size() + 1, 0));
    for (size_t i = 1; i <= first.size(); ++i) {
        dp[i][0] = i;
    }

    for (size_t i = 1; i <= second.size(); ++i) {
        dp[0][i] = i;
    }

    for (size_t i = 1; i <= first.size(); ++i) {
        for (size_t j = 1; j <= second.size(); ++j) {
            int insertion = dp[i][j - 1] + 1;
            int deletion = dp[i - 1][j] + 1;
            int match = dp[i - 1][j - 1];
            int mismatch = dp[i - 1][j - 1] + 1;
            if (first[i - 1] == second[j - 1]) {
                dp[i][j] = std::min({insertion, deletion, match});
            } else {
                dp[i][j] = std::min({insertion, deletion, mismatch});
            } 
        }
    }

    std::cout << dp[first.size()][second.size()] << '\n';

    return 0;
}
```
