# Последняя цифра числа Фибоначчи

**Ограничение времени:** 1 с  
**Ограничение памяти:** 256.0 Мб  
**Ввод:** стандартный ввод или `input.txt`  
**Вывод:** стандартный вывод или `output.txt`

Дано целое число $ n $. Требуется найти **последнюю цифру** $ n $-го числа Фибоначчи $ F_n $.

## Важно

Числа Фибоначчи растут экспоненциально, и даже $ F_{139} $ не помещается в стандартные 64-битные типы.  
Однако нас интересует **только последняя цифра**, поэтому можно вычислять последовательность **по модулю 10**:

- $ f_0 = 0 $
- $ f_1 = 1 $
- $ f_i = (f_{i-1} + f_{i-2}) \bmod 10 $

Кроме того, последовательность последних цифр **периодична** (период Пизано для модуля 10 равен 60), но даже без использования периода линейное вычисление за $ O(n) $ укладывается в ограничения ($ n \leq 10^6 $).

---

## Формат ввода

Целое число $ n $ ($ 0 \leq n \leq 10^6 $).

## Формат вывода

Последняя цифра числа $ F_n $.

---

## Примеры

### Пример 1

**Ввод:**
```
3
```

**Вывод:**
```
2
```

### Пример 2

**Ввод:**
```
139
```

**Вывод:**
```
1
```

### Пример 3

**Ввод:**
```
91239
```

**Вывод:**
```
6
```
## Решение

main.cpp
```cpp
#include <iostream>

int main() {
    int n;
    std::cin >> n;
    if (n == 0) {
        std::cout << n << '\n';
        return 0;
    }

    int prev = 0, cur = 1;
    for (int i = 1; i < n; ++i) {
        int tmp = prev;
        prev = cur;
        cur = (prev + tmp) % 10;
    }

    std::cout << cur << '\n';
    return 0;
}
```
