# Разбиения числа

**Ограничение времени:** 1 с  
**Ограничение памяти:** 64.0 Мб  
**Ввод:** стандартный ввод или `input.txt`  
**Вывод:** стандартный вывод или `output.txt`

Дано целое число $n$. Требуется вывести **все разбиения** числа $n$ на сумму натуральных чисел.

> **Разбиение** — это представление числа в виде суммы натуральных слагаемых, где **порядок слагаемых не важен**.  
> Для вывода каждое разбиение должно быть записано в **невозрастающем порядке** (от большего к меньшему).

## Формат входных данных

Одно целое число $n$ ($1 \leq n \leq 30$).

## Формат выходных данных

Выведите все разбиения числа $n$ на сумму натуральных чисел в невозрастающем порядке.  
Каждое разбиение — в отдельной строке, слагаемые разделяйте знаком `+`.

## Примеры

### Пример 1

**Ввод:**
```
5
```

**Вывод:**
```
5
4+1
3+2
3+1+1
2+2+1
2+1+1+1
1+1+1+1+1
```

### Пример 2

**Ввод:**
```
6
```

**Вывод:**
```
6
5+1
4+2
4+1+1
3+3
3+2+1
3+1+1+1
2+2+2
2+2+1+1
2+1+1+1+1
1+1+1+1+1+1
```
## Решение

main.cpp
```cpp
#include <iostream>
#include <vector>

void partitions(int n, int max_part, std::vector<int> & current) {
    if (n == 0) {
        for (size_t i = 0; i < current.size(); ++i) {
            if (i > 0) std::cout << "+";
            std::cout << current[i];
        }
        std::cout << '\n';
        return;
    }

    for (int i = std::min(max_part, n); i >= 1; --i) {
        current.push_back(i);
        partitions(n - i, i, current);
        current.pop_back();
    }
}

int main() {
    int n;
    std::cin >> n;
    std::vector<int> temp;
    partitions(n, n, temp);
    return 0;
}
```
