# Выполнение операций с очередью

**Ограничение времени:** 1 с  
**Ограничение памяти:** 256.0 Мб  
**Ввод:** стандартный ввод или `input.txt`  
**Вывод:** стандартный вывод или `output.txt`

Изначально у вас есть пустая очередь. Далее вам поступает $ q $ запросов. Каждый запрос одного из следующих типов:

- **Запрос 1-ого типа:** положить число $ x $ в конец очереди.  
- **Запрос 2-ого типа:** удалить первый элемент из очереди.

После каждого запроса необходимо вывести число, которое находится в начале очереди. Если очередь пуста, то выведите $-1$.

> **Гарантия:** если поступил запрос второго типа, то очередь к этому моменту **не пуста**.

---

## Формат ввода

Первая строка содержит единственное число $ q $ — количество запросов.

Далее следует $ q $ строк. Каждая из этих строк может иметь один из следующих видов:

- Для запроса первого типа: `1 x` (без кавычек).  
- Для запроса второго типа: `2` (без кавычек).

## Формат вывода

Вывод должен состоять из $ q $ строк. Каждая строка должна содержать ответ на соответствующий запрос:

- число `front`, где `front` — элемент в начале очереди,  
- либо `-1`, если очередь пуста.

---

## Пример

**Ввод:**
```
5
1 5
2
1 6
1 7
2
```

**Вывод:**
```
5
-1
6
6
7
```

---

## Примечание

**Ограничения:**

- $ 1 \leq q \leq 10^6 $
- Во всех запросах первого типа: $ 1 \leq x \leq 10^6 $
## Решение

main.cpp
```cpp
#include <iostream>
#include <deque>

int main() {
    std::ios::sync_with_stdio(false);
    std::cin.tie(0);

    std::deque<int> dq;
    int n;
    std::cin >> n;
    for (int i = 0; i < n; ++i) {
        int mode;
        std::cin >> mode;
        
        if (mode == 1) {
            int x;
            std::cin >> x;
            dq.push_back(x);
        }

        if (mode == 2) {
            dq.pop_front();
        }

        std::cout << (dq.empty() ? -1 : dq.front()) << '\n';
    }

    return 0;
}
```
