# Максимальное произведение подмножества

**Ограничение времени:** 1 с  
**Ограничение памяти:** 64.0 Мб  
**Ввод:** стандартный ввод или `input.txt`  
**Вывод:** стандартный вывод или `output.txt`

Дан массив целых чисел $ a_1, a_2, \dots, a_n $.  
Разрешается выбрать **любое непустое подмножество** элементов.  
Требуется найти подмножество с **максимальным возможным произведением** и вывести **индексы** выбранных элементов (нумерация с 1). Порядок индексов не важен.

---

## Формат входных данных

- Первая строка: целое число $ n $ ($ 1 \leq n \leq 2 \cdot 10^5 $).
- Вторая строка: $ n $ целых чисел $ a_i $ ($ -10^9 \leq a_i \leq 10^9 $).

## Формат выходных данных

Выведите индексы элементов (через пробел), образующих подмножество с максимальным произведением.

---

## Ключевые наблюдения

- **Нули** никогда не включаются, если есть хотя бы один ненулевой элемент, дающий положительное или большее отрицательное произведение.
- **Положительные числа** всегда выгодно включать — они увеличивают модуль произведения и не меняют знак.
- **Отрицательные числа**:  
  - Чётное количество → произведение положительно → выгодно.  
  - Нечётное количество → произведение отрицательно → лучше исключить **наименьшее по модулю** отрицательное число (т.е. наибольшее по значению).
- Если **все числа ≤ 0** и нет положительных:
  - Если есть **нули**, то лучше выбрать **один ноль**, чем отрицательное произведение.
  - Если **нет нулей**, и **нечётное количество отрицательных**, то исключаем одно (наименьшее по модулю).
  - Если **только один элемент** — выбираем его (подмножество не может быть пустым).

---

## Примеры

### Пример 1

**Ввод:**
```
5
-1 -2 -3 -4 -5
```

**Вывод:**
```
2 3 4 5
```

### Пример 2

**Ввод:**
```
5
-1 0 -2 4 3
```

**Вывод:**
```
1 3 4 5
```
## Решение

main.cpp
```cpp
#include <iostream>
#include <vector>
#include <algorithm>
#include <numeric>

int main() {
    int n;
    std::cin >> n;
    std::vector<std::pair<long long, long long>> vec(n);
    for (int i = 0 ; i < n; ++i) {
        long long value;
        std::cin >> value;
        vec[i] = {value, i + 1};
    }

    std::sort(vec.begin(), vec.end());

    std::vector<long long> answer;
    int l = 0, r = n - 1;
    
    while (r >= 0 && vec[r].first > 0) {
        answer.push_back(vec[r].second);
        --r;
    }

    while (l + 1 <= r && vec[l].first < 0 && vec[l + 1].first < 0) {
        answer.push_back(vec[l].second);
        answer.push_back(vec[l + 1].second);
        l += 2;
    }

    if (answer.empty()) {
        answer.push_back(vec[r].second);
    }
    std::sort(answer.begin(), answer.end());

    for (long long ind : answer) {
        std::cout << ind << ' ';
    }
    std::cout << '\n';
    return 0;
}
```
