# Выполнение операций со списком

**Ограничение времени:** 1 с  
**Ограничение памяти:** 256.0 Мб  
**Ввод:** стандартный ввод или `input.txt`  
**Вывод:** стандартный вывод или `output.txt`

Изначально у вас есть пустой список. Далее поступает `q` запросов. Каждый запрос одного из следующих типов:

- **Тип 1:** добавить число `y` после `x`-го числа в списке. Если `x = 0`, то число `y` становится новым началом списка.  
- **Тип 2:** вывести число, находящееся на позиции `x` в списке.  
- **Тип 3:** удалить число, находящееся на позиции `x` в списке.

После каждого запроса второго типа необходимо вывести соответствующее число.  
Гарантируется, что во всех запросах индексы корректны:

- Для запросов типа 1: `0 ≤ x ≤ size_i` и `1 ≤ y ≤ 10⁶`  
- Для запросов типов 2 и 3: `1 ≤ x ≤ size_i`

## Формат ввода

Первая строка содержит целое число `q` — количество запросов.  
Каждая из следующих `q` строк описывает один запрос:

- `"1 x y"` — запрос типа 1  
- `"2 x"` — запрос типа 2  
- `"3 x"` — запрос типа 3

## Формат вывода

Для каждого запроса типа 2 выведите одно число — значение элемента на позиции `x`.

## Пример

**Ввод:**
```
8
1 0 5
2 1
3 1
1 0 6
1 0 7
2 2
1 1 5
2 2
```

**Вывод:**
```
5
6
5
```

## Примечание

Пусть `size_i` — размер списка перед выполнением `i`-го запроса.

## Ограничения

`1 ≤ q ≤ 5000`
## Решение

main.cpp
```cpp
#include <iostream>
#include <vector>


int main() {
    int q;
    std::cin >> q;
    std::vector<int> list;
    for (int i = 0; i < q; ++i) {
        int type, x;
        std::cin >> type >> x;
        if (type == 1) {
            int y;
            std::cin >> y;
            list.insert(list.begin() + x, y);
            continue;
        } 

        if (type == 2) {
            std::cout << list[x - 1] << '\n';
            continue;
        }

        if (type == 3) {
            list.erase(list.begin() + (x - 1));
        }
    }
    return 0;
}
```
