# Минимум слева

**Ограничение времени:** 1 с  
**Ограничение памяти:** 256.0 Мб  
**Ввод:** стандартный ввод или `input.txt`  
**Вывод:** стандартный вывод или `output.txt`

Дан массив `a`, состоящий из `n` чисел.

Для каждой позиции `i` (`1 ≤ i ≤ n`) вычислите величину  
`b_i = min(a[1], a[2], …, a[i])`.

## Формат ввода

Первая строка содержит единственное число `n` — количество чисел в массиве.

Вторая строка содержит `n` чисел `a_i`, где `a_i` — число на `i`-й позиции в массиве `a`. Числа разделены пробелами.

**Ограничения:**  
`1 ≤ n ≤ 10^5`;  
`1 ≤ a_i ≤ 10^5` для всех `1 ≤ i ≤ n`.

## Формат вывода

Выведите `n` чисел `b_i`, разделённых пробелами.

## Пример

Ввод:
```
5
5 2 3 4 1
```

Вывод:
```
5 2 2 2 1
```
## Решение

main.cpp
```cpp
#include <iostream>
#include <vector>

int main() {
    int n;
    std::cin >> n;
    std::vector<int> vec(n);
    std::cin >> vec[0];
    for (int i = 1; i < n; ++i) {
        std::cin >> vec[i];
        vec[i] = std::min(vec[i - 1], vec[i]);
    }

    for (int i = 0; i < n; ++i) {
        if (i > 0) std::cout << ' ';
        std::cout << vec[i];
    }
    std::cout << '\n';
    
    return 0;
}
```
