# Предметный указатель

**Ограничение времени**: 1 с  
**Ограничение памяти**: 64.0 Мб  
**Ввод**: стандартный ввод или `input.txt`  
**Вывод**: стандартный вывод или `output.txt`

---

## Задание

Профессор написал научную книгу и составил для неё **предметный указатель** — список ключевых слов с указанием страниц, на которых они встречаются.

Теперь профессор хочет для **каждой страницы** выписать в **алфавитном порядке** все **уникальные** ключевые слова, которые на неё попали.

---

## Формат ввода

- Сначала задано натуральное число `n` (≤ 1000) — количество записей.
- Затем `n` строк. В каждой строке:
  - **ключевое слово** — строка из латинских букв, длина ≤ 16, не пустая,
  - **номер страницы** — натуральное число (≤ 1000).

> ⚠️ Слова могут повторяться — в том числе на одной странице.

---

## Формат вывода

- Выведите **страницы в порядке возрастания**.
- Для каждой страницы:
  - сначала номер страницы,
  - затем через пробел — **уникальные слова в алфавитном порядке**.
- **Без завершающего пробела** в конце строки.
- Если слово встречается на странице несколько раз — выводить его **только один раз**.

---

## Пример

**Ввод:**
```text
5
derivative 10
function 2
function 10
function 10
limit 7
```

**Вывод:**
```text
2 function
7 limit
10 derivative function
```

---

## Примечание

Напишите **полную программу**, читающую из `std::cin` и пишущую в `std::cout`.  
Используйте `std::map<int, std::set<std::string>>` для автоматической сортировки страниц и слов.
## Решение

main.cpp
```cpp
#include <iostream>
#include <map>
#include <set>

int main() {
    int n;
    std::cin >> n;
    std::string word;
    int page;
    std::map<int, std::set<std::string>> mp;
    for (int i = 0; i < n; ++i) {
        std::cin >> word >> page;
        mp[page].insert(word);
    }

    for (const auto & [page, words] : mp) {
        std::cout << page;
        for (const std::string & word : words) {
            std::cout << ' ' << word;
        }
        std::cout << '\n';
    }
    std::cout << '\n';
    return 0;
}
```
