# Приближённый двоичный поиск  
**Ограничение времени**  
 2 с  
**Ограничение памяти**  
 64.0 Мб  
**Ввод**  
 стандартный ввод или input.txt  
**Вывод**  
 стандартный вывод или output.txt  

В этой задаче нужно применить функцию `std::lower_bound` и итераторы для быстрого поиска ближайшего элемента в отсортированном массиве.

---

### Формат ввода

В первой строке входных данных содержатся натуральные числа `n` и `k`, не превосходящие 100000.  
Во второй строке задаются `n` целых чисел первого массива, отсортированного по неубыванию.  
В третьей строке — `k` целых чисел второго массива.  
Каждое число в обоих массивах по модулю не превосходит `2⋅10⁹`.  
Второй массив, в отличие от первого, **не отсортирован**.

---

### Формат вывода

Для каждого из `k` чисел выведите в отдельной строке число из первого массива, **наиболее близкое к данному**.  
Если таких несколько, выведите **меньшее из них**.

---

### Пример 1

**Ввод:**
```text
5 5
1 3 5 7 9 
2 4 8 1 6 
```

**Вывод:**
```text
1
3
7
1
5
```

---

### Пример 2

**Ввод:**
```text
6 11
1 1 4 4 8 120 
1 2 3 4 5 6 7 8 63 64 65 
```

**Вывод:**
```text
1
1
4
4
4
4
8
8
8
8
120
```

---

### Пример 3

**Ввод:**
```text
10 10
-5 1 1 3 5 5 8 12 13 16 
0 3 7 -17 23 11 0 11 15 7 
```

**Вывод:**
```text
1
3
8
-5
16
12
1
12
16
8
```
## Решение

main.cpp
```cpp
#include <iostream>
#include <vector>
#include <algorithm>

int main() {
    int n, k;
    std::cin >> n >> k;
    std::vector<int> sortedVector(n);
    for (int i = 0; i < n; ++i) {
        std::cin >> sortedVector[i];
    }
    for (int i = 0; i < k; ++i) {
        int search;
        std::cin >> search;
        std::vector<int>::iterator it = std::lower_bound(sortedVector.begin(), sortedVector.end(), search);
        if (it == sortedVector.end()) {
            std::cout << *(std::prev(it)) << '\n';
            continue;
        }
        int x1, x2 = *it;
        if (it == sortedVector.begin()) {
            x1 = x2;
        } else {
            x1 = *(std::prev(it));
        }

        if (abs(search - x1) <= abs(search - x2)) {
            std::cout << x1 << '\n';
            continue;
        }

        std::cout << x2 << '\n';
    }
    return 0;
}
```
