# Скобочная последовательность

**Ограничение времени**  
 4 с  
**Ограничение памяти**  
 64.0 Мб  
**Ввод**  
 стандартный ввод или input.txt  
**Вывод**  
 стандартный вывод или output.txt  

На вход подаётся скобочная последовательность — строка, которая состоит из скобок `()[]{}`. Вам нужно определить, является ли она правильной. В правильной скобочной последовательности каждой открывающей скобке соответствует закрывающая и пары скобок корректно вложены друг в друга.

---

### Формат ввода

Строка, состоящая из символов `()[]{}`.

---

### Формат вывода

Напечатайте `YES`, если скобочная последовательность является правильной, и `NO` в противном случае.

---

### Пример 1

**Ввод:**
```text
({{{[]})
```

**Вывод:**
```text
NO
```

---

### Пример 2

**Ввод:**
```text
}()[]{
```

**Вывод:**
```text
NO
```

---

### Пример 3

**Ввод:**
```text
{(())()}[]
```

**Вывод:**
```text
YES
```
## Решение

main.cpp
```cpp
#include <iostream>
#include <stack>
#include <unordered_map>

int main() {
    std::unordered_map<char, char> mp = {
        {'(', ')'},
        {'[', ']'},
        {'{', '}'}
    };
    std::stack<char> parenthesis;
    char curChar;
    while (std::cin >> curChar) {
        if (!parenthesis.empty() && mp.contains(parenthesis.top()) && mp[parenthesis.top()] == curChar) {
            parenthesis.pop();
            continue;
        }

        parenthesis.push(curChar);
    }

    std::cout << (parenthesis.empty() ? "YES" : "NO") << '\n';
    return 0;
}
```
