# Сумма дробей

**Ограничение времени:** 1 с  
**Ограничение памяти:** 64.0 Мб  
**Ввод:** стандартный ввод или `input.txt`  
**Вывод:** стандартный вывод или `output.txt`

Даны две обыкновенные дроби: $\frac{a}{b}$ и $\frac{c}{d}$, где $a, b, c, d$ — положительные целые числа.

Необходимо найти их сумму и вывести результат в **несократимом виде**.

## Формат входных данных

- Первая строка: два числа $a$ и $b$ — числитель и знаменатель первой дроби.  
- Вторая строка: два числа $c$ и $d$ — числитель и знаменатель второй дроби.

**Гарантируется:**  
$$
1 \leq a, b, c, d < 10^9
$$

## Формат выходных данных

Два целых числа — числитель и знаменатель суммы, приведённой к несократимому виду.

Если знаменатель равен 1, его всё равно следует вывести.

## Примеры

### Пример 1

**Ввод**  
```
1 2
1 3
```

**Вывод**  
```
5 6
```

### Пример 2

**Ввод**  
```
3 4
2 8
```

**Вывод**  
```
1 1
```
## Решение

main.cpp
```cpp
#include <iostream>
#include <numeric>


int main() {
    long long a, b, c, d;
    std::cin >> a >> b >> c >> d;
    long long num = a * d + b * c;
    long long denum = b * d;
    long long gcd = std::gcd(num, denum);
    num /= gcd;
    denum /= gcd;
    std::cout << num << ' ' << denum << '\n';
    return 0;
}
```
