# Объединение множеств

**Ограничение времени:** 1 с  
**Ограничение памяти:** 64.0 Мб  
**Ввод:** стандартный ввод или `input.txt`  
**Вывод:** стандартный вывод или `output.txt`

Даны несколько множеств целых чисел.  
Нужно найти количество различных элементов, которые встречаются хотя бы в одном из них.

## Формат входных данных

Первая строка содержит число $n$ ($1 \leq n \leq 1000$) — количество множеств.

Далее следуют $n$ строк, описывающих множества. В $i$-й строке сначала указано число $k_i$ ($0 \leq k_i \leq 1000$) — размер множества, затем $k_i$ различных целых чисел ($1 \leq x \leq 10^6$) — элементы множества.

## Формат выходных данных

Выведите одно число — размер объединения всех данных множеств.

## Пример 1

**Ввод**
```
3
3 1 2 3
4 2 4 5 6
2 1 7
```

**Вывод**
```
7
```

## Пример 2

**Ввод**
```
4
2 10 20
3 5 10 15
1 100
3 15 20 25
```

**Вывод**
```
6
```
## Решение

main.cpp
```cpp
#include <iostream>
#include <unordered_set>

int main() {
    int n;
    std::cin >> n;
    std::unordered_set<int> answer;
    for (int i = 0; i < n; ++i) {
        int k;
        std::cin >> k;
        for (int j = 0; j < k; ++j) {
            int tmp;
            std::cin >> tmp;
            answer.insert(tmp);
        }
    }

    std::cout << answer.size() << '\n';
    
    return 0;
}
```
