# Камни 2

**Ограничение времени:** 1 с  
**Ограничение памяти:** 256.0 Мб  
**Ввод:** стандартный ввод или `input.txt`  
**Вывод:** стандартный вывод или `output.txt`

Вы играете в игру **"Камни"**: игру для двух игроков с двумя наборами камней — по $n$ и $m$ штук.

С каждым ходом один игрок может забрать **одну** из следующих комбинаций камней:
- **1 камень** из любого одного набора;
- **2 камня** из одного и того же набора;
- **2 камня из одного набора и 1 камень из другого** (итого 3 камня за ход).

Когда камень забрали, он выходит из игры.  
Побеждает игрок, который заберёт **последний камень**.  
**Первый ход за вами.**

Вы и ваш оппонент играете **оптимально**.

## Формат ввода

В первой строке содержатся два числа $n$ ($1 \leq n \leq 1000$) и $m$ ($1 \leq m \leq 1000$) — количество камней в первом и втором наборах соответственно.

## Формат вывода

В единственной строке выведите:
- `Lose`, если вы **заведомо проиграете** при оптимальной игре обоих сторон,
- `Win`, если у вас есть **выигрышная стратегия**.

## Примеры

### Пример 1

**Ввод:**
```
4 4
```

**Вывод:**
```
Lose
```

### Пример 2

**Ввод:**
```
17 72
```

**Вывод:**
```
Win
```

### Пример 3

**Ввод:**
```
7 5
```

**Вывод:**
```
Win
```
## Решение

main.cpp
```cpp
#include <iostream>
#include <vector>
#include <algorithm>

template <typename T>
using row = std::vector<T>;

template <typename T>
using matrix = std::vector<row<T>>;

int main() {
    int n, m;
    std::cin >> n >> m;
    matrix<bool> field(n + 1, row<bool>(m + 1, false));
    for (int i = 1; i <= m; ++i) {
        field[0][i] = !std::min(field[0][i - 1], field[0][std::max(i - 2, 0)]);
    }

    for (int i = 1; i <= n; ++i) {
        field[i][0] = !std::min(field[i - 1][0], field[std::max(i - 2, 0)][0]);
    }

    for (int i = 1; i <= m; ++i) {
        field[1][i] = !std::min({field[0][i], field[1][i - 1], field[1][std::max(i - 2, 0)]});
    }
    
    for (int i = 1; i <= n; ++i) {
        field[i][1] = !std::min({field[i][0], field[i - 1][1], field[std::max(i - 2, 0)][1]});
    }

    for (int i = 2; i <= n; ++i) {
        for (int j = 2; j <= m; ++j) {
            field[i][j] = !std::min({
                field[i - 1][j], field[i][j - 1],
                field[i - 2][j], field[i][j - 2],
                field[i - 2][j - 1], field[i - 1][j - 2]
            });
        }
    }

    std::cout << (field[n][m] ? "Win" : "Lose") << '\n';
    return 0;
}
```
