# A+B матрицы

**Ограничение времени:** 1 с  
**Ограничение памяти:** 256.0 Мб  
**Ввод:** стандартный ввод или `input.txt`  
**Вывод:** стандартный вывод или `output.txt`

Необходимо вычислить сумму двух матриц $ C = A + B $, где сложение выполняется **поэлементно**:
$$
C_{i,j} = A_{i,j} + B_{i,j}
$$

---

## Формат ввода

- Первая строка: два целых числа $ n $ и $ m $ ($ 1 \leq n, m \leq 10 $) — размеры матриц.
- Следующие $ n $ строк: по $ m $ целых чисел — элементы матрицы $ A $, где $ -100 \leq A_{i,j} \leq 100 $.
- Следующие $ n $ строк: по $ m $ целых чисел — элементы матрицы $ B $, где $ -100 \leq B_{i,j} \leq 100 $.

## Формат вывода

Выведите $ n $ строк по $ m $ чисел — элементы результирующей матрицы $ C $.

---

## Примеры

### Пример 1

**Ввод:**
```
2 3
1 2 3
4 5 6
-1 -2 -3
-4 -5 -6
```

**Вывод:**
```
0 0 0
0 0 0
```

### Пример 2

**Ввод:**
```
2 3
1 2 3
4 5 6
1 2 3
4 5 6
```

**Вывод:**
```
2 4 6
8 10 12
```

### Пример 3

**Ввод:**
```
1 3
1 2 3
4 5 6
```

**Вывод:**
```
5 7 9
```
## Решение

main.cpp
```cpp
#include <iostream>
#include <vector>

int main() {
    std::ios::sync_with_stdio(false);
    std::cin.tie(0);

    int n, m;
    std::cin >> n >> m;
    std::vector<std::vector<int>> A(n, std::vector<int>(m, 0)), B(n, std::vector<int>(m, 0));
    for (int i = 0; i < n; ++i) {
        for (int j = 0; j < m; ++j) {
            std::cin >> A[i][j];
        }
    }

    for (int i = 0; i < n; ++i) {
        for (int j = 0; j < m; ++j) {
            std::cin >> B[i][j];
            B[i][j] += A[i][j];
            std::cout << B[i][j] << ' ';
        }
        std::cout << '\n';
    }

    return 0;
}
```
