# Обработка заявок

**Ограничение времени:** 1 с  
**Ограничение памяти:** 64.0 Мб  
**Ввод:** стандартный ввод или `input.txt`  
**Вывод:** стандартный вывод или `output.txt`

В компании рабочий день длится с **08:00 до 18:00** (всего 600 минут).  
Существует $N$ переговорных комнат, которые сотрудники бронируют для встреч.

Известно $M$ заявок на проведение встреч. Каждая заявка описывается:
- временем начала в **минутах от начала дня** (от 08:00),
- и длительностью (также в минутах).

Например, заявка `(120, 60)` означает встречу, начинающуюся в **10:00** и продолжающуюся **1 час**.

Заявки обрабатываются **по порядку поступления** (в том же порядке, в котором они даны во входных данных).  
Если встреча может быть проведена **хотя бы в одной из переговорок** (учитывая уже утверждённые бронирования), то она **добавляется в расписание**.  
Если же во **всех** $N$ переговорках в указанный интервал уже занято, то заявка **отклоняется**.

Ваша задача — определить, **сколько заявок будет отклонено**.

## Формат входных данных

- В первой строке заданы два целых числа $N$ и $M$ — количество переговорок и количество заявок ($1 \leq N \leq 10$, $1 \leq M \leq 10^5$).
- В следующих $M$ строках заданы два числа $s_i$ и $d_i$:
  - $s_i$ — время начала встречи в минутах от 08:00 ($0 \leq s_i \leq 600$),
  - $d_i$ — длительность встречи ($1 \leq d_i \leq 600$).

> **Примечание:** Любая встреча гарантированно полностью помещается в рабочий день, то есть $s_i + d_i \leq 600$.

## Формат выходных данных

Выведите одно число — количество **отклонённых** заявок.

## Примеры

### Пример 1

**Ввод:**
```
2 5
0 120
60 60
100 60
200 100
300 100
```

**Вывод:**
```
1
```

### Пример 2

**Ввод:**
```
3 10
240 120
0 180
360 120
0 180
240 120
480 120
90 60
0 180
180 120
240 120
```

**Вывод:**
```
2
```
## Решение

main.cpp
```cpp
#include <iostream>
#include <vector>

int main() {
    std::ios::sync_with_stdio(false);
    std::cin.tie(0);

    int n, m;
    std::cin >> n >> m;
    std::vector<std::vector<bool>> meatingRooms(n, std::vector<bool>(601, false));
    int deviations = 0;
    for (int i = 0; i < m; ++i) {
        int start, time;
        std::cin >> start >> time;
        bool haveMeatingRoom = false;
        for (int j = 0; j < n && !haveMeatingRoom; ++j) {
            bool canBe = true;
            for (int k = start; k < start + time; ++k) {
                if (meatingRooms[j][k] == true) {
                    canBe = false;
                    break;
                }
            }

            if (!canBe) {
                continue;
            }

            haveMeatingRoom = true;
            for (int k = start; k < start + time; ++k) {
                meatingRooms[j][k] = true;
            }
        }
        // std::cout << std::boolalpha;
        // std::cout << "i = " << i << " | " << start << ' ' << time << ' ' << haveMeatingRoom << '\n';
        deviations += !haveMeatingRoom;
    }

    std::cout << deviations << '\n';
    return 0;
}
```
