# Расстановка королей на шахматной доске

**Ограничение времени:** 2 с  
**Ограничение памяти:** 512.0 Мб  
**Ввод:** стандартный ввод или `input.txt`  
**Вывод:** стандартный вывод или `output.txt`

## Условие задачи

Шахматы — очень интересная древнейшая настольная игра для двух игроков. Для решения этой задачи необязательно знать шахматные правила, но это может быть полезно.

В шахматах **король** — самая важная фигура. Король может сделать ход на любую из **8 соседних клеток** шахматной доски. Соседними считаются клетки:
- слева, справа, сверху, снизу,
- и 4 по диагонали от рассматриваемой.

В шахматной партии на игровом поле ровно один король каждого цвета.

Рассмотрим задачу-головоломку о нескольких шахматных королях на доске произвольного размера.

Дана шахматная доска с $r$ строками и $c$ столбцами. Требуется найти **наибольшее количество королей**, которых можно разместить на доске $r \times c$, соблюдая следующие условия:

1. В любой клетке на доске может находиться **не более одного короля**.
2. У **каждого короля** должен быть **хотя бы один возможный ход на свободную клетку** (то есть хотя бы одна из соседних 8 клеток должна существовать и быть пустой).

## Формат ввода

Единственная строка содержит два целых числа $r$ и $c$.

**Ограничения:**  
$1 \leq r, c \leq 100$

## Формат вывода

Выведите наибольшее количество королей, удовлетворяющее условиям задачи.

## Примеры

### Пример 1

**Ввод:**
```
5 1
```

**Вывод:**
```
3
```

### Пример 2

**Ввод:**
```
3 3
```

**Вывод:**
```
8
```

### Пример 3

**Ввод:**
```
4 4
```

**Вывод:**
```
12
```
## Решение

main.cpp
```cpp
#include <iostream>
#include <algorithm>
using namespace std;

int main() {
    ios::sync_with_stdio(false);
    cin.tie(nullptr);

    int r, c;
    cin >> r >> c;

    if (r == 1 && c == 1) {
        cout << 0 << '\n';
        return 0;
    }

    if (r == 1 || c == 1) {
        int n = max(r, c);
        // На линии: каждые 3 клетки → 2 короля, но крайние должны иметь выход
        // Максимум = n - ceil(n / 3.0) = n - (n + 2) / 3
        cout << n - (n + 2) / 3 << '\n';
        return 0;
    }

    // Общий случай: 2D
    long long total = 1LL * r * c;
    long long empty = 1LL * ((r + 2) / 3) * ((c + 2) / 3);
    cout << total - empty << '\n';

    return 0;
}
```
