# Проверка вложенности скобок

**Ограничение времени:** 1 с  
**Ограничение памяти:** 64.0 Мб  
**Ввод:** стандартный ввод или `input.txt`  
**Вывод:** стандартный вывод или `output.txt`

Васе поручили проверить корректность вложенности скобок в строке.  
Строка состоит из трёх типов скобок: **круглых** `()`, **квадратных** `[]` и **фигурных** `{}`.

Строка называется **корректной**, если выполнены оба условия:

1. Каждой открывающей скобке найдётся соответствующая **закрывающая того же типа**.
2. Скобки **правильно вложены**: ни одна скобка не закрывается раньше, чем будут закрыты все скобки, открытые внутри неё.

---

## Формат входных данных

Дана одна строка $ S $, состоящая только из символов `(`, `)`, `[`, `]`, `{`, `}`.  
Длина строки не превышает $ 10^6 $.

## Формат выходных данных

Выведите:

- `YES`, если строка корректна,
- `NO` — в противном случае.

---

## Примеры

### Пример 1

**Ввод:**
```
{[()]}
```

**Вывод:**
```
YES
```

### Пример 2

**Ввод:**
```
([)]
```

**Вывод:**
```
NO
```
## Решение

main.cpp
```cpp
#include <iostream>
#include <stack>
#include <unordered_map>

int main() {
    std::ios::sync_with_stdio(false);
    std::cin.tie(0);

    std::unordered_map<char, char> mp = {
        {')', '('},
        {']', '['},
        {'}', '{'}
    };

    std::stack<char> st;
    char curChar;

    while (std::cin >> curChar) {
        if (st.empty()) {
            st.push(curChar);
            continue;
        }

        if (mp.contains(curChar)) {
            if (st.top() == mp[curChar]) {
                st.pop();
                continue;
            } else {
                break;
            }
        } else {
            st.push(curChar);
        }
    }

    std::cout << (st.empty() ? "YES" : "NO") << '\n';

    return 0;
}
```
