# Выполнение операций с множеством

**Ограничение времени:** 1 с  
**Ограничение памяти:** 256.0 Мб  
**Ввод:** стандартный ввод или `input.txt`  
**Вывод:** стандартный вывод или `output.txt`

Изначально у вас есть пустое множество. Далее вам поступает `q` запросов. Каждый запрос одного из следующих типов:

- **Запрос 1-го типа:** добавить число `x` во множество  
- **Запрос 2-го типа:** проверить, содержится ли число `x` во множестве

## Формат ввода

Первая строка содержит единственное число `q` — количество запросов.

Далее следует `q` строк. Каждая из этих строк может иметь один из следующих видов:

- Для запроса первого типа: `1 x` (без кавычек)  
- Для запроса второго типа: `2 x` (без кавычек)

## Формат вывода

Вывод должен состоять из `count` строк, где `count` — количество запросов второго типа.  
Каждая строка должна содержать одно число:

- `0`, если такого числа **не было** во множестве  
- `1`, если такое число **было** во множестве

## Пример

Ввод:
```
9
2 5
1 5
2 5
1 6
1 10
2 7
1 7
2 10
2 7
```

Вывод:
```
0
1
0
1
1
```

## Примечание

**Ограничения:**  
`1 ≤ q ≤ 10^5`  
Для запросов первого и второго типов выполнено: `1 ≤ x ≤ 10^9`
## Решение

main.cpp
```cpp
#include <iostream>
#include <unordered_set>


int main() {
    int q;
    std::cin >> q;
    std::unordered_set<int> st;
    for (int i = 0 ; i < q; ++i) {
        int mode, x;
        std::cin >> mode >> x;
        if (mode == 1) {
            st.insert(x);
            continue;
        }

        std::cout << st.contains(x) << '\n';
    }
    return 0;
}
```
