# Распределение сувениров

**Ограничение времени:** 1 с  
**Ограничение памяти:** 256.0 Мб  
**Ввод:** стандартный ввод или `input.txt`  
**Вывод:** стандартный вывод или `output.txt`

## Условие задачи

Три пирата делят свою добычу, в которую входят $n$ предметов разной ценности.  
Ваша задача — определить, **можно ли разделить все предметы на три группы** так, чтобы **суммарная ценность в каждой группе была одинаковой**.

Каждый предмет должен быть отдан **ровно одному** пирату.

## Формат ввода

- Первая строка содержит целое число $n$ — количество предметов.
- Вторая строка содержит $n$ целых чисел $v_1, v_2, \dots, v_n$ — ценности предметов.

**Ограничения:**  
$1 \leq n \leq 20$,  
$1 \leq v_i \leq 30$ для всех $i$.

## Формат вывода

Выведите:
- `1`, если предметы можно разделить на **три поднабора с равной суммой**,
- `0` — в противном случае.

## Примеры

### Пример 1

**Ввод:**
```
13
1 2 3 4 5 5 7 7 8 10 12 19 25
```

**Вывод:**
```
1
```

### Пример 2

**Ввод:**
```
7
1 2 3 4 5 6 7
```

**Вывод:**
```
0
```

### Пример 3

**Ввод:**
```
5
12 13 14 15 23
```

**Вывод:**
```
0
```
## Решение

main.cpp
```cpp
#include <iostream>
#include <vector>
#include <numeric>


int main() {
    int n;
    std::cin >> n;
    std::vector<int> v(n);
    for (int i = 0; i < n; ++i) {
        std::cin >> v[i];
    }
    int V = std::accumulate(v.begin(), v.end(), 0);
    if (V % 3 != 0) {
        std::cout << "0\n";
        return 0;
    }

    V /= 3;
    std::vector<std::vector<std::vector<bool>>> dp(n + 1, std::vector<std::vector<bool>>(V + 1, std::vector<bool>(V + 1, false)));
    dp[0][0][0] = true;
    for (int i = 1; i <= n; ++i) {
        for (int s1 = 0; s1 <= V; ++s1) {
            for (int s2 = 0; s2 <= V; ++s2) {
                dp[i][s1][s2] = dp[i - 1][s1][s2];
                if (s1 >= v[i - 1]) {
                    dp[i][s1][s2] = dp[i][s1][s2] || dp[i - 1][s1 - v[i - 1]][s2];
                }
                if (s2 >= v[i - 1]) {
                    dp[i][s1][s2] = dp[i][s1][s2] || dp[i - 1][s1][s2 - v[i - 1]];
                }
            }
        }
    }

    std::cout << dp[n][V][V] << '\n';
    
    return 0;
}
```
