# Максимальное произведение трёх чисел

**Ограничение времени:** 1 с  
**Ограничение памяти:** 256.0 Мб  
**Ввод:** стандартный ввод или `input.txt`  
**Вывод:** стандартный вывод или `output.txt`

Дана последовательность целых чисел $ a_1, a_2, \dots, a_n $.  
Требуется найти **максимальное произведение трёх элементов** с **попарно различными индексами**:

$$
\max_{\substack{1 \leq i,j,k \leq n \\ i \ne j,\; i \ne k,\; j \ne k}} (a_i \cdot a_j \cdot a_k)
$$

> Значения элементов могут совпадать, но индексы — обязательно разные.

---

## Формат ввода

- Первая строка: целое число $ n $ ($ 3 \leq n \leq 2 \cdot 10^5 $).
- Вторая строка: $ n $ целых чисел $ a_1, \dots, a_n $, разделённых пробелами  
  ($ -2 \cdot 10^5 \leq a_i \leq 2 \cdot 10^5 $).

## Формат вывода

Выведите одно целое число — максимальное возможное произведение трёх различных по индексу элементов.

---

## Примеры

### Пример 1

**Ввод:**
```
3
1 2 3
```

**Вывод:**
```
6
```

### Пример 2

**Ввод:**
```
3
-1 -2 -2
```

**Вывод:**
```
-4
```

### Пример 3

**Ввод:**
```
4
-1 -3 -2 -4
```

**Вывод:**
```
-6
```

### Пример 4

**Ввод:**
```
5
-1 0 -3 -2 0
```

**Вывод:**
```
0
```
## Решение

main.cpp
```cpp
#include <iostream>
#include <vector>
#include <algorithm>


int main() {
    int n;
    std::cin >> n;
    std::vector<long long> vec(n);
    for (int i = 0 ; i < n; ++i) {
        std::cin >> vec[i];
    }

    std::sort(vec.begin(), vec.end());
    std::cout << std::max(vec[n - 1] * vec[n - 2] * vec[n - 3], vec[0] * vec[1] * vec[n - 1]) << '\n';
    return 0;
}
```
