# Перестановки

**Ограничение времени:** 1 с  
**Ограничение памяти:** 256.0 Мб  
**Ввод:** стандартный ввод или `input.txt`  
**Вывод:** стандартный вывод или `output.txt`

Выведите число перестановок $P(n)$.

## Формат ввода

В первой строке находится одно число $n$ ($1 \leq n \leq 7$).

## Формат вывода

Выведите ответ на задачу.

## Примеры

### Пример 1

**Ввод**  
```
2
```

**Вывод**  
```
2
```

### Пример 2

**Ввод**  
```
1
```

**Вывод**  
```
1
```

### Пример 3

**Ввод**  
```
3
```

**Вывод**  
```
6
```
## Решение

main.cpp
```cpp
#include <iostream>

long long permutations(int n) {
    if (n == 1 || n == 0) {
        return 1;
    }

    return n * permutations(n - 1);
}

int main() {
    int n;
    std::cin >> n;
    std::cout << permutations(n) << '\n';
    return 0;
}
```
