# Поиск самого частого элемента в массиве

**Ограничение времени:** 1 с  
**Ограничение памяти:** 256.0 Мб  
**Ввод:** стандартный ввод или `input.txt`  
**Вывод:** стандартный вывод или `output.txt`

Дан массив $a$, состоящий из $n$ чисел.

Найдите элемент $x$, который встречается наибольшее количество раз в $a$.  
Если таких элементов несколько, необходимо вывести **наименьший**.

## Формат ввода

Первая строка содержит единственное число $n$ — количество чисел в массиве.

Вторая строка содержит $n$ чисел $a_i$, где $a_i$ — число на $i$-й позиции в массиве $a$. Числа разделены пробелами.

**Ограничения:**  
$1 \leq n \leq 10^5$;  
$1 \leq a_i \leq 10^5$ для всех $1 \leq i \leq n$.

## Формат вывода
в
Выведите число $x$, который встречается наибольшее количество раз в $a$.

## Пример 1

**Ввод**
```
5
1 2 3 2 1
```

**Вывод**
```
1
```

## Пример 2

**Ввод**
```
5
1 2 3 2 2
```

**Вывод**
```
2
```

## Пример 3

**Ввод**
```
5
1 2 3 2 3
```

**Вывод**
```
2
```
## Решение

main.cpp
```cpp
#include <iostream>
#include <unordered_map>

int main() {
    int n;
    std::cin >> n;
    int maxFreq = 0, answer;
    std::unordered_map<int, int> mp;
    for (int i = 0; i < n; ++i) {
        int a;
        std::cin >> a;
        ++mp[a];
        if (mp[a] >= maxFreq) {
            if (mp[a] == maxFreq && a >= answer) {
                continue;
            }
            
            answer = a;
            maxFreq = mp[a];
        }
    }

    std::cout << answer << '\n';
    return 0;
}
```
