# Сувениры

**Ограничение времени:** 1 с  
**Ограничение памяти:** 256.0 Мб  
**Ввод:** стандартный ввод или `input.txt`  
**Вывод:** стандартный вывод или `output.txt`

Турист зашёл в сувенирную лавку и нашёл там много привлекательных вариантов подарков друзьям и родным.  
Всего в лавке $n$ сувениров, стоимость $i$-го сувенира — $c_i$ рублей.

Определите, какое **наибольшее количество сувениров** сможет купить турист, если он может потратить **не более $S$ рублей**.

> Каждый сувенир можно купить **не более одного раза**.

## Формат ввода

- Первая строка содержит два целых числа: $n$ (количество сувениров) и $S$ (бюджет).
- Следующие $n$ строк содержат по одному целому числу $c_i$ — стоимость $i$-го сувенира.

**Ограничения:**
- $1 \leq n \leq 10^3$
- $0 \leq S \leq 2 \cdot 10^6$
- $0 \leq c_i \leq 2 \cdot 10^6$

## Формат вывода

Выведите одно целое число — **максимальное количество сувениров**, которые турист может купить, не превысив бюджет.

## Примеры

### Пример 1

**Ввод:**
```
3 50
20
50
30
```

**Вывод:**
```
2
```

### Пример 2

**Ввод:**
```
10 1
0
1
0
1
0
1
0
1
0
1
```

**Вывод:**
```
6
```

### Пример 3

**Ввод:**
```
1 10
500
```

**Вывод:**
```
0
```
## Решение

main.cpp
```cpp
#include <iostream>
#include <vector>
#include <algorithm>

int main() {
    int n, S;
    std::cin >> n >> S;
    std::vector<int> souvenirs(n);
    for (int i = 0; i < n; ++i) {
        std::cin >> souvenirs[i];
    }
    std::sort(souvenirs.begin(), souvenirs.end());
    int answer = 0;
    for (size_t i = 0; i < souvenirs.size() && S >= souvenirs[i]; ++i) {
        ++answer;
        S -= souvenirs[i];
    }

    std::cout << answer << '\n';

    return 0;
}
```
