# Граф из списка маршрутов

**Ограничение времени:** 3 с  
**Ограничение памяти:** 256.0 Мб  
**Ввод:** стандартный ввод или `input.txt`  
**Вывод:** стандартный вывод или `output.txt`

Транспортная система города состоит из $n$ остановок. В городе ходит $m$ маршрутов. Каждый маршрут представляет собой последовательность остановок $c_1, c_2, \dots, c_k$. Транспорт ходит в обоих направлениях: от $c_1$ к $c_k$, и от $c_k$ к $c_1$.

Требуется построить два графа.

- **Первый граф**: остановки — вершины, рёбра — соседние остановки на любом из маршрутов. Этот граф можно использовать для определения времени в пути между остановками в городе.
- **Второй граф**: остановки — вершины, рёбра — любые две остановки, достижимые без пересадок. Этот граф можно использовать для определения минимального количества пересадок в пути между остановками в городе.

Гарантируется, что все остановки на маршрутах различны.

## Формат ввода

В первой строке заданы два числа $n$ и $m$ — количество остановок и количество маршрутов в городе соответственно.

В следующих $m$ строках заданы маршруты.

Каждый маршрут задан числом $k_i$ — количество остановок в $i$-м маршруте, и последовательностью $c_1, c_2, \dots, c_{k_i}$ ($1 \leq c_j \leq n$) — остановки на маршруте.

## Формат вывода

В первых $n$ строках выведите матрицу смежности **первого графа**.

В следующих $n$ строках выведите матрицу смежности **второго графа**.

## Примеры

### Пример 1

**Ввод**  
```
5 3
3 1 2 3
2 1 2
5 5 2 4 3 1
```

**Вывод**  
```
0 1 1 0 0
1 0 1 1 1
1 1 0 1 0
0 1 1 0 0
0 1 0 0 0
0 1 1 1 1
1 0 1 1 1
1 1 0 1 1
1 1 1 0 1
1 1 1 1 0
```

### Пример 2

**Ввод**  
```
5 3
3 1 3 5
2 2 4
5 1 2 3 4 5
```

**Вывод**  
```
0 1 1 0 0
1 0 1 1 0
1 1 0 1 1
0 1 1 0 1
0 0 1 1 0
0 1 1 1 1
1 0 1 1 1
1 1 0 1 1
1 1 1 0 1
1 1 1 1 0
```

## Ограничения

- $2 \leq n \leq 1000$
- $1 \leq m \leq 100$
- $2 \leq k_i \leq 10$ для всех $i$ от $1$ до $m$
- $\sum_{i=1}^{m} k_i \leq 1000$
## Решение

main.cpp
```cpp
#include <iostream>
#include <vector>

template <typename T>
using row = std::vector<T>;

template <typename T>
using matrix = std::vector<row<T>>;

template <typename T>
std::ostream & operator<<(std::ostream & os, const matrix<T> & rhs) {
    for (size_t i = 0; i < rhs.size(); ++i) {
        for (size_t j = 0; j < rhs[0].size(); ++j) {
            if (j > 0) os << ' ';
            os << rhs[i][j];
        }
        os << '\n';
    }
    return os;
}

int main() {
    std::ios::sync_with_stdio(false);
    std::cin.tie(0);

    int n, m;
    std::cin >> n >> m;
    matrix<int> graph1(n, row<int>(n, 0)), graph2(n, row<int>(n, 0));
    for (int i = 0; i < m; ++i) {
        int k;
        std::cin >> k;
        std::vector<int> route(k);
        for (int j = 0; j < k; ++j) {
            std::cin >> route[j];
            if (j > 0) {
                int prev = route[j - 1] - 1;
                int cur = route[j] -1;
                graph1[cur][prev] = 1;
                graph1[prev][cur] = 1;
            }
        }

        for (int j1 = 0; j1 < k; ++j1) {
            for (int j2 = j1 + 1; j2 < k; ++j2) {
                int prev = route[j1] - 1;
                int cur = route[j2] - 1;
                graph2[cur][prev] = 1;
                graph2[prev][cur] = 1;
            }
        }
    }

    std::cout << graph1 << graph2;
    return 0;
}


```
