# Реклама на билбордах

**Ограничение времени:** 3 с  
**Ограничение памяти:** 256.0 Мб  
**Ввод:** стандартный ввод или `input.txt`  
**Вывод:** стандартный вывод или `output.txt`

Рассмотрим задачу менеджера рекламного агентства.

Есть:
- $n$ **билбордов**,
- $w$ **недель** планирования вперёд,
- $k$ **рекламодателей**.

Каждый рекламодатель $i$ подаёт заявку:
- готов платить $c_i$ **за одну неделю** размещения,
- хочет разместить рекламу **не более чем на $w_i$ недель** (от 0 до $w_i$).

**Ограничения размещения:**
- В **каждую неделю** на **каждом билборде** может быть размещено **не более одного объявления**.
- В **одну и ту же неделю** **один рекламодатель** не может быть размещён **на нескольких билбордах** (т.е. максимум одно его объявление в неделю).
- Объявление можно **переносить** между билбордами и неделями, но **общее число недель размещения** для рекламодателя $i$ не должно превышать $w_i$.

Цель: **максимизировать суммарную прибыль**, то есть сумму $m_i \cdot c_i$ по всем рекламодателям, где $m_i$ — фактическое число недель размещения рекламы $i$-го рекламодателя.

> Общее число **рекламных слотов** за весь период: $n \cdot w$ (по одному на каждый билборд каждую неделю).

## Формат ввода

- Первая строка: три целых числа $n$, $k$, $w$  
  ($1 \leq n \leq 10^3$, $1 \leq k \leq 10^5$, $1 \leq w \leq 10^2$).
- Следующие $k$ строк: по два целых числа $c_i$ и $w_i$  
  ($1 \leq c_i \leq 10^2$, $1 \leq w_i \leq w$).

## Формат вывода

Выведите одно целое число — **максимально возможную прибыль**.

> **Подсказка:** это задача о **жадном выборе**. Сортируйте рекламодателей по убыванию $c_i$, и для каждого выделяйте столько недель, сколько возможно, не превышая ни $w_i$, ни общее число доступных слотов.

## Примеры

### Пример 1

**Ввод:**
```
2 4 3
5 1
2 2
4 3
1 3
```

**Вывод:**
```
21
```

### Пример 2

**Ввод:**
```
1 1 1
1 1
```

**Вывод:**
```
1
```
## Решение

main.cpp
```cpp
#include <iostream>
#include <vector>
#include <algorithm>


int main() {
    int n, k, w;
    std::cin >> n >> k >> w;
    std::vector<std::pair<int, int>> advertisers(k);
    for (int i = 0; i < k; ++i) {
        std::cin >> advertisers[i].first >> advertisers[i].second;
    }
    std::sort(advertisers.begin(), advertisers.end(), std::greater<std::pair<int, int>>());
    long long answer = 0;
    int curBillBoard = 0, curWeak = 0, curAdvertiser = 0;
    while (curBillBoard < n && curAdvertiser < k) {
        int amountOfWeaks = std::min(w, advertisers[curAdvertiser].second);
        curWeak += amountOfWeaks;
        curBillBoard += (curWeak / w);
        curWeak %= w;
        answer += 1ll * amountOfWeaks * advertisers[curAdvertiser].first;
        ++curAdvertiser;
    }

    if (curBillBoard == n) {
        --curAdvertiser;
        answer -= curWeak * advertisers[curAdvertiser].first;
    }

    std::cout << answer << '\n';
    
    return 0;
}
```
