# A + B

**Ограничение времени:** 1 с  
**Ограничение памяти:** 256.0 Мб  
**Ввод:** стандартный ввод или `input.txt`  
**Вывод:** стандартный вывод или `output.txt`

Задача-разминка: найдите сумму двух чисел.

---

## Формат ввода

Два целых числа $ a $ и $ b $ на одной строке, разделённые пробелом.  
**Ограничения:** $ 0 \leq a, b \leq 9 $

## Формат вывода

Выведите одно целое число — сумму $ a + b $.

---

## Пример

**Ввод:**
```
9 7
```

**Вывод:**
```
16
```
## Решение

main.cpp
```cpp
#include <iostream>

int main() {
    int a, b;
    std::cin >> a >> b;
    std::cout << a + b << '\n';
    return 0;
}
```
