# Максимальное произведение четырёх чисел

**Ограничение времени:** 1 с  
**Ограничение памяти:** 256.0 Мб  
**Ввод:** стандартный ввод или `input.txt`  
**Вывод:** стандартный вывод или `output.txt`

Дана последовательность целых чисел $ a_1, a_2, \dots, a_n $.  
Требуется найти **максимальное произведение четырёх элементов** с **попарно различными индексами**:

$$
\max_{\substack{1 \leq i,j,k,l \leq n \\ \text{все индексы различны}}} (a_i \cdot a_j \cdot a_k \cdot a_l)
$$

> Значения элементов могут совпадать, но индексы — обязательно разные.

---

## Формат ввода

- Первая строка: целое число $ n $ ($ 4 \leq n \leq 2 \cdot 10^5 $).
- Вторая строка: $ n $ целых чисел $ a_1, \dots, a_n $, разделённых пробелами  
  ($ -2 \cdot 10^4 \leq a_i \leq 2 \cdot 10^4 $).

## Формат вывода

Выведите одно целое число — максимальное возможное произведение четырёх различных по индексу элементов.

---

## Подход

Произведение четырёх чисел максимально в одном из следующих случаев:

1. Четыре **наибольших** числа (все положительные или смешанные).
2. Два **наименьших** (самых отрицательных) и два **наибольших** — так как $ (-) \cdot (-) = (+) $.
3. Четыре **наименьших** (если все отрицательные, то их произведение положительно и может быть велико).
4. Комбинации с нулями — если все возможные произведения отрицательны, а есть ноль, то максимум = 0.

Достаточно рассмотреть кандидатов, построенных из:
- до 4 наибольших элементов,
- до 4 наименьших элементов.

Всего таких кандидатов — конечное число (например, перебрать все способы выбрать 4 элемента из 8: 4 самых больших + 4 самых маленьких).

---

## Примеры

### Пример 1

**Ввод:**
```
4
1 2 3 4
```

**Вывод:**
```
24
```

### Пример 2

**Ввод:**
```
4
-1 -2 3 4
```

**Вывод:**
```
24
```

### Пример 3

**Ввод:**
```
5
-1 -3 -2 -4 -5
```

**Вывод:**
```
120
```

### Пример 4

**Ввод:**
```
6
0 -1 0 -3 -2 100
```

**Вывод:**
```
0
```
## Решение

main.cpp
```cpp
#include <iostream>
#include <vector>
#include <algorithm>


int main() {
    int n;
    std::cin >> n;
    std::vector<long long> vec(n);
    for (int i = 0 ; i < n; ++i) {
        std::cin >> vec[i];
    }

    std::sort(vec.begin(), vec.end());
    std::vector<long long> helper = {vec[n - 1] * vec[n - 2], vec[n - 3] * vec[n - 4], vec[0] * vec[1], vec[2] * vec[3]};
    std::cout << std::max({helper[0] * helper[1], helper[0] * helper[2], helper[2] * helper[3]}) << '\n';
    return 0;
}
```
