# Проверка работ

**Ограничение времени**: 1 с  
**Ограничение памяти**: 64.0 Мб  
**Ввод**: стандартный ввод или `input.txt`  
**Вывод**: стандартный вывод или `output.txt`

---

## Задание

В университете проводится письменная контрольная работа. `N` студентов сдают свои работы в общую стопку, причём некоторые кладут свою работу **сверху**, а другие (считая, что чем позже их работу проверят, тем лучше) — **снизу**.  
Проверяются работы в том порядке, в котором лежат, начиная с **верхней**.  
Определите, чья работа будет проверена `k`-й по счёту.

---

## Формат ввода

- Первая строка содержит одно натуральное число `N` (не превосходит `10000`) — число студентов.
- Каждая из последующих `N` строк содержит:
  - фамилию студента — строку из латинских букв длиной от 2 до 10 символов,
  - через пробел слово `top` или `bottom` — положил ли студент работу **сверху** или **снизу**.
- Следующая строка содержит одно целое число `M` (от `0` до `10000`) — количество запросов.
- Следующие `M` строк содержат по одному числу `x_i` (от `1` до `N`) — номер в стопке интересующей нас работы.

---

## Формат вывода

Выведите `M` строк. В `i`-й строке — фамилия студента, чья работа будет проверена `x_i`-й по счёту.

---

## Пример 1

**Ввод:**
```text
3
Ivanov top
Petrov top
Sidorov bottom
2
1
3
```

**Вывод:**
```text
Petrov
Sidorov
```

---

## Пример 2

**Ввод:**
```text
3
Ivanov top
Ivanov bottom
Ivanov top
4
1
2
3
1
```

**Вывод:**
```text
Ivanov
Ivanov
Ivanov
Ivanov
```

---
## Решение

main.cpp
```cpp
#include <iostream>
#include <deque>
#include <vector>


int main() {
    int N;
    std::cin >> N;
    std::string surname, direction;
    std::deque<std::string> deq;
    for (int i = 0; i < N; ++i) {
        std::cin >> surname >> direction;
        direction == "top" ? deq.push_front(surname) : deq.push_back(surname);
    }

    std::vector<std::string> notebooks(deq.begin(), deq.end());

    int M, number;
    std::cin >> M;
    for (int i = 0; i < M; ++i) {
        std::cin >> number;
        std::cout << notebooks[number - 1] << '\n';
    }

    return 0;
}
```
