# ln 2

## Ограничения

| Параметр             | Значение            |
|----------------------|---------------------|
| Ограничение времени  | 1 секунда           |
| Ограничение памяти   | 64.0 Мб             |
| Ввод                 | стандартный ввод или `input.txt` |
| Вывод                | стандартный вывод или `output.txt` |

---

## Условие задачи

Значение натурального логарифма \(\ln 2\) представляется в виде суммы:
$ 1 - \frac{1}{2} + \frac{1}{3} - \frac{1}{4} + \ldots + \frac{(-1)^{n+1}}{n} $
с точностью до $ O(n) $.

Напишите программу, выводящую сумму первых \(n\) членов этого ряда.  
Попробуйте также обойтись **без использования инструкции `if`**.

### Формат ввода

Вводится целое положительное число \(n\), помещающееся в тип `int`.

### Формат вывода

Программа выводит ответ на задачу.

---

## Примеры

### Пример 1

Ввод:
```
3
```

Вывод:
```
0.833333
```

### Пример 2

Ввод:
```
2
```

Вывод:
```
0.5
```

### Пример 3

Ввод:
```
1
```

Вывод:
```
1
```

---

## Примечание

Используйте тип `double` для работы с числами с плавающей точкой.  
Используйте стандартную точность вывода (по умолчанию — 6 знаков после запятой).
## Решение

main.cpp
```cpp
#include <iostream>

int main() {
    int n;
    std::cin >> n;
    double sum = 0;
    double sign = 1;
    for (int i = 1; i <= n; ++i) {
        sum += sign / i;
        sign *= -1;
    }
    std::cout << sum << '\n';
    return 0;
}
```
