# Двоичный поиск

**Ограничение времени:** 1 с  
**Ограничение памяти:** 256.0 Мб  
**Ввод:** стандартный ввод или `input.txt`  
**Вывод:** стандартный вывод или `output.txt`

## Условие задачи

Дана **отсортированная по возрастанию** последовательность $K$ из $n$ **неповторяющихся** целых чисел.  
Требуется найти **индекс** элемента, равного заданному числу $q$.  
Если такого элемента нет, вывести $-1$.

Индексы нумеруются с **нуля**.

## Формат ввода

- Первая строка: целое число $n$ — размер массива.  
- Вторая строка: $n$ целых чисел $k_0, k_1, \dots, k_{n-1}$, удовлетворяющих условию  
  $k_0 < k_1 < \dots < k_{n-1}$.  
- Третья строка: целое число $q$ — искомое значение.

**Ограничения:**  
$1 \leq n \leq 3 \cdot 10^4$,  
$1 \leq k_i \leq 10^9$ для всех $0 \leq i < n$,  
$1 \leq q \leq 10^9$.

## Формат вывода

Выведите:
- индекс $i$, такой что $k_i = q$, если такой элемент существует,
- $-1$, если элемента $q$ в массиве нет.

## Примеры

### Пример 1

**Ввод:**
```
7
1 3 7 8 9 12 15
8
```

**Вывод:**
```
3
```

### Пример 2

**Ввод:**
```
7
1 3 7 8 9 12 15
12
```

**Вывод:**
```
5
```

### Пример 3

**Ввод:**
```
3
1 2 3
4
```

**Вывод:**
```
-1
```
## Решение

main.cpp
```cpp
#include <iostream>
#include <vector>

int main() {
    int n;
    std::cin >> n;
    std::vector<int> k(n);
    for (int i = 0; i < n; ++i) {
        std::cin >> k[i];
    }
    int q;
    std::cin >> q;
    int l = 0, r = n - 1;
    while (l < r) {
        int m = (l + r) / 2;
        if (k[m] == q) {
            std::cout << m << '\n';
            return 0;
        }

        if (k[m] < q) {
            l = m + 1;
        } else {
            r = m - 1;
        }
    }

    if (k[l] != q) {
        std::cout << "-1\n";
    } else {
        std::cout << l << '\n';
    }
    return 0;
}
```
