# Быстрая сортировка — худший вход

**Ограничение времени:** 1 с  
**Ограничение памяти:** 256.0 Мб  
**Ввод:** стандартный ввод или `input.txt`  
**Вывод:** стандартный вывод или `output.txt`

## Условие задачи

Задано целое число $n$. Требуется построить массив из $n$ **попарно различных** целых чисел, на котором **детерминированная** реализация быстрой сортировки (с выбором опорного элемента как среднего по индексу: $m = \left\lfloor \frac{l + r}{2} \right\rfloor$) выполнит **максимально возможное количество рекурсивных вызовов**.

Такой «худший» вход заставляет алгоритм каждый раз разбивать массив на части максимально несбалансированно (например, одна часть содержит $n-1$ элемент, другая — 0), что приводит к глубине рекурсии $O(n)$ и общему времени работы $O(n^2)$.

## Формат ввода

- Единственная строка содержит целое число $n$ — размер массива.

**Ограничения:**  
$1 \leq n \leq 1000$

## Формат вывода

Выведите $n$ различных целых чисел $a_1, a_2, \dots, a_n$, разделённых пробелами, образующих **худший случай** для описанной версии быстрой сортировки.

**Ограничения на значения:**  
$1 \leq a_i \leq 10^9$, все $a_i$ попарно различны.

Если существует несколько подходящих массивов, выведите **любой** из них.

## Примеры

### Пример 1

**Ввод:**
```
2
```

**Вывод:**
```
2 1
```

### Пример 2

**Ввод:**
```
4
```

**Вывод:**
```
2 4 1 3
```

## Примечание

Цель — максимизировать **глубину рекурсии** или **общее число рекурсивных вызовов** при фиксированном способе выбора опорного элемента (средний по индексу, не по значению).
## Решение

main.cpp
```cpp
#include <iostream>
#include <vector>

int main() {
    std::ios::sync_with_stdio(false);
    std::cin.tie(nullptr);

    int n;
    std::cin >> n;

    std::vector<int> evens, odds;

    for (int i = 1; i <= n; ++i) {
        if (i % 2 == 0) {
            evens.push_back(i);
        } else {
            odds.push_back(i);
        }
    }

    // Выводим сначала чётные, потом нечётные
    bool first = true;
    for (int x : evens) {
        if (!first) std::cout << " ";
        std::cout << x;
        first = false;
    }
    for (int x : odds) {
        if (!first) std::cout << " ";
        std::cout << x;
        first = false;
    }
    std::cout << '\n';

    return 0;
}
```
