# Выполнение операций со стеком

**Ограничение времени:** 1 с  
**Ограничение памяти:** 256.0 Мб  
**Ввод:** стандартный ввод или `input.txt`  
**Вывод:** стандартный вывод или `output.txt`

Изначально у вас есть пустой стек. Далее поступает $ q $ запросов. Каждый запрос одного из следующих типов:

- **Запрос 1-го типа:** `1 x` — положить число $ x $ на вершину стека.  
- **Запрос 2-го типа:** `2` — извлечь число с вершины стека.

После **каждого** запроса необходимо вывести число, находящееся на вершине стека.  
Если стек пуст, выведите `-1`.

> **Гарантия:** при поступлении запроса второго типа стек **не пуст**.

---

## Формат ввода

Первая строка содержит единственное число $ q $ — количество запросов.

Далее следует $ q $ строк. Каждая строка имеет один из следующих видов:

- `1 x` — запрос первого типа,  
- `2` — запрос второго типа.

## Формат вывода

Вывод должен состоять из $ q $ строк. Каждая строка содержит:

- значение `top` — число на вершине стека,  
- или `-1`, если стек пуст.

---

## Пример

**Ввод:**
```
5
1 5
2
1 6
1 7
2
```

**Вывод:**
```
5
-1
6
7
6
```

---

## Примечание

**Ограничения:**

- $ 1 \leq q \leq 10^6 $
- Для всех запросов первого типа: $ 1 \leq x \leq 10^6 $
## Решение

main.cpp
```cpp
#include <iostream>
#include <stack>

int main() {
    std::ios::sync_with_stdio(false);
    std::cin.tie(0);

    int n;
    std::cin >> n;
    std::stack<int> st;
    for (int i = 0 ; i < n; ++i) {
        int mode;
        std::cin >> mode;

        if (mode == 1) {
            int x;
            std::cin >> x;
            st.push(x);
        } else if (mode == 2) {
            if (!st.empty()) {
                st.pop();
            }
        }

        std::cout << (st.empty() ? -1 : st.top()) << '\n';
    }

    return 0;
}
```
