# Лента из букв

**Ограничение времени:** 1 с  
**Ограничение памяти:** 64.0 Мб  
**Ввод:** стандартный ввод или `input.txt`  
**Вывод:** стандартный вывод или `output.txt`

Дана строка $ s $ длины $ n $, состоящая только из заглавных латинских букв.  

За один ход разрешается взять **либо левый крайний**, либо **правый крайний** символ текущей ленты и **приписать его в конец результирующей строки**.

Требуется получить строку, **минимальную в лексикографическом порядке**.

---

## Формат входных данных

- Первая строка содержит целое число $ n $ ($ 1 \leq n \leq 2 \cdot 10^5 $).
- Вторая строка содержит строку $ s $ из $ n $ заглавных букв (от `A` до `Z`).

## Формат выходных данных

Выведите искомую строку минимальной лексикографической длины.

---

## Пример 1

**Ввод:**
```
6
ACDBCB
```

**Вывод:**
```
ABCCBD
```

## Пример 2

**Ввод:**
```
4
DCBA
```

**Вывод:**
```
ABCD
```
## Решение

main.cpp
```cpp
#include <iostream>
#include <string>

int main() {
    int n;
    std::cin >> n;
    std::string input;
    std::cin >> input;
    
    std::string answer;
    int l = 0, r = n - 1;
    while (l <= r) {
        if (input[l] <= input[r]) {
            answer.push_back(input[l]);
            ++l;
        } else {
            answer.push_back(input[r]);
            --r;
        }
    }

    std::cout << answer << '\n';
    return 0;
}
```
