# Теннисный турнир

**Ограничение времени:** 1 с  
**Ограничение памяти:** 256.0 Мб  
**Ввод:** стандартный ввод или `input.txt`  
**Вывод:** стандартный вывод или `output.txt`

## Условие задачи

В теннисном турнире принимают участие $n$ роботов-спортсменов. Про каждого из них известно, насколько хорошо он играет. Умение $i$-го робота описывается числом $a_i$. В игре двух роботов всегда побеждает тот, у кого умение играть в теннис больше. В этой задаче мы будем полагать, что все значения $a_i$ различны.

В каждом раунде теннисного турнира роботы разбиваются на пары. Если количество продолжающих участие в турнире нечётное, то один из роботов без игры проходит в следующий раунд. После игры в каждой из пар в следующий раунд выходит победитель, а проигравший выбывает из турнира.

Определите, какое **наибольшее количество игр** в турнире может выиграть $k$-й робот-спортсмен.

## Формат ввода

В первой строке входных данных заданы число роботов $n$ и интересующий нас номер $k$.  
Во второй строке записаны $n$ чисел $a_i$.

**Ограничения:**  
$1 \leq n \leq 1000$,  
$1 \leq k \leq n$,  
$1 \leq a_i \leq n$.  
Все $a_i$ различны.

## Формат вывода

Выведите наибольшее количество игр в турнире, которые может выиграть робот с номером $k$.

## Примеры

### Пример 1

**Ввод:**
```
4 2
1 2 4 3
```

**Вывод:**
```
1
```

### Пример 2

**Ввод:**
```
5 3
1 2 3 4 5
```

**Вывод:**
```
2
```

### Пример 3

**Ввод:**
```
4 2
1 2 3 4
```

**Вывод:**
```
1
```

## Примечание

Обратите внимание, что в описании турнира **не фиксируется способ распределения роботов на пары**. Это означает, что вы можете выбирать разбиение на пары так, чтобы максимизировать количество побед $k$-го робота.
## Решение

main.cpp
```cpp
#include <iostream>
#include <vector>
using namespace std;

int main() {
    ios::sync_with_stdio(false);
    cin.tie(nullptr);

    int n, k;
    cin >> n >> k;

    vector<int> a(n);
    for (int i = 0; i < n; ++i) {
        cin >> a[i];
    }

    int skill = a[k - 1];
    int w = 0, s = 0;
    for (int x : a) {
        if (x < skill) ++w;
        else if (x > skill) ++s;
    }

    int wins = 0;
    while (w > 0) {
        ++wins;
        --w; // k побеждает одного слабого

        int w_odd = w % 2;
        int s_odd = s % 2;

        if (w_odd && s_odd) {
            --w;      // смешанная пара: слабый проигрывает
            w_odd = 0;
        }

        w = w / 2 + w_odd;
        s = s / 2 + s_odd;
    }

    cout << wins << '\n';
    return 0;
}
```
