# Видимость влево

**Ограничение времени:** 1 с  
**Ограничение памяти:** 256.0 Мб  
**Ввод:** стандартный ввод или `input.txt`  
**Вывод:** стандартный вывод или `output.txt`

Дан массив $ a $, состоящий из $ n $ чисел.  
Для каждого элемента $ a_i $ нужно определить, **сколько элементов слева от него он "видит"**.

Элемент $ a_i $ **видит** элемент $ a_j $ (где $ j < i $), если:

- $ a_i > a_z $ для **всех** $ z $, таких что $ j \leq z < i $.

Иными словами, $ a_i $ видит $ a_j $, если при движении от $ a_i $ влево до $ a_j $ **все промежуточные элементы строго меньше** $ a_i $, и сам $ a_j $ также меньше $ a_i $.  
Видимость прерывается первым элементом, который **не меньше** $ a_i $.

---

## Формат ввода

- Первая строка содержит целое число $ n $ ($ 1 \leq n \leq 3 \cdot 10^5 $).
- Вторая строка содержит $ n $ целых чисел $ a_1, a_2, \dots, a_n $ ($ 1 \leq a_i \leq 3 \cdot 10^5 $).

## Формат вывода

Выведите одну строку, содержащую $ n $ целых чисел — количество видимых элементов **влево** для каждого $ a_i $.

---

## Примеры

### Пример 1

**Ввод:**
```
5
1 2 3 4 5
```

**Вывод:**
```
0 1 2 3 4
```

### Пример 2

**Ввод:**
```
5
1 2 2 1 3
```

**Вывод:**
```
0 1 0 0 4
```

### Пример 3

**Ввод:**
```
9
1 2 3 4 5 4 3 2 1
```

**Вывод:**
```
0 1 2 3 4 0 0 0 0
```

### Пример 4

**Ввод:**
```
8
1 7 2 6 3 5 5 6
```

**Вывод:**
```
0 1 0 1 0 1 0 3
```

### Пример 5

**Ввод:**
```
5
1 1 1 1 1
```

**Вывод:**
```
0 0 0 0 0
```
## Решение

main.cpp
```cpp
#include <iostream>
#include <vector>
#include <stack>

int main() {
    std::ios::sync_with_stdio(false);
    std::cin.tie(0);

    int n;
    std::cin >> n;
    std::vector<int> a(n);
    for (int i = 0; i < n; ++i) {
        std::cin >> a[i];
    }

    std::stack<int> st;
    std::vector<int> ans(n);

    for (int i = 0; i < n; ++i) {
        while (!st.empty() && a[st.top()] < a[i]) {
            st.pop();
        }

        int prevGe = st.empty() ? -1 : st.top();
        ans[i] = i - prevGe - 1;

        st.push(i);
    }

    for (int i = 0; i < n; ++i) {
        std::cout << ans[i] << (i == n-1 ? '\n' : ' ');
    }

    return 0;
}
```
