# Пароль сейфа

**Ограничение времени:** 1 с  
**Ограничение памяти:** 64.0 Мб  
**Ввод:** стандартный ввод или `input.txt`  
**Вывод:** стандартный вывод или `output.txt`

У вас есть набор из $N$ различных цифр (без повторов). Нужно составить из всех этих цифр число (переставив их в некотором порядке), которое делится на $M$ без остатка.

Если таких чисел несколько, требуется вывести **лексикографически наименьшее** (т.е. наименьшее по значению).  
Если ни одно число не делится на $M$, выведите `No solutions`.

## Формат ввода

В первой строке находятся два целых числа $N$ и $M$ ($1 \leq N \leq 9$, $1 \leq M \leq 10^6$).  
Во второй строке — $N$ различных цифр $d_1, d_2, \dots, d_N$ (каждая от 0 до 9).

Гарантируется, что среди цифр может быть 0, и он может стоять на первом месте (то есть ведущие нули допустимы — число все равно считается правильно составленным из всех данных цифр).

## Формат вывода

Одну строку: искомое число (как последовательность цифр) — лексикографически наименьшую перестановку, дающую делимость на $M$; либо `No solutions`, если подходящей перестановки не существует.

## Примеры

### Пример 1

**Ввод:**
```
3 6
1 2 3
```

**Вывод:**
```
132
```

### Пример 2

**Ввод:**
```
4 7
0 1 4 6
```

**Вывод:**
```
1064
```

### Пример 3

**Ввод:**
```
3 37
0 5 8
```

**Вывод:**
```
No solutions
```
## Решение

main.cpp
```cpp
#include <iostream>
#include <vector>
#include <algorithm>


int main() {
    int n, m;
    std::cin >> n >> m;
    std::vector<int> digits(n);
    for (int i = 0; i < n; ++i) {
        std::cin >> digits[i];
    }

    std::sort(digits.begin(), digits.end());
    do {
        long long number = 0;
        for (int digit : digits) {
            number = number * 10 + digit;
        }
        if (number % m == 0) {
            std::string answer = std::string(digits.begin(), digits.end());
            for (size_t i = 0; i < answer.size(); ++i) {
                answer[i] += '0';
            }
            std::cout << answer << '\n';
            return 0;
        }
    } while (std::next_permutation(digits.begin(), digits.end()));

    std::cout << "No solutions\n";
    return 0;
}
```
