# Максимальное произведение

**Ограничение времени:** 1 с  
**Ограничение памяти:** 256.0 Мб  
**Ввод:** стандартный ввод или `input.txt`  
**Вывод:** стандартный вывод или `output.txt`

Дана последовательность неотрицательных целых чисел $ a_1, a_2, \dots, a_n $.  
Требуется найти **максимальное произведение** двух **разных по индексу** элементов:

$$
\max_{1 \leq i \ne j \leq n} a_i \cdot a_j
$$

> Обратите внимание: индексы $ i $ и $ j $ должны быть различны, но значения $ a_i $ и $ a_j $ могут совпадать.

---

## Формат ввода

- Первая строка: целое число $ n $ ($ 2 \leq n \leq 2 \cdot 10^5 $).
- Вторая строка: $ n $ неотрицательных целых чисел $ a_1, \dots, a_n $, разделённых пробелами  
  ($ 0 \leq a_i \leq 2 \cdot 10^5 $).

## Формат вывода

Выведите одно целое число — максимальное попарное произведение.

---

## Примеры

### Пример 1

**Ввод:**
```
3
1 2 3
```

**Вывод:**
```
6
```

### Пример 2

**Ввод:**
```
2
0 1
```

**Вывод:**
```
0
```

## Решение

main.cpp
```cpp
#include <iostream>
#include <vector>
#include <algorithm>


int main() {
    int n;
    std::cin >> n;
    std::vector<long long> vec(n);
    for (int i = 0 ; i < n; ++i) {
        std::cin >> vec[i];
    }

    std::sort(vec.begin(), vec.end());
    std::cout << vec[n - 1] * vec[n - 2] << '\n';
    return 0;
}
```
