# Очередь с приоритетами

**Ограничение времени**  
 4 с  
**Ограничение памяти**  
 64.0 Мб  
**Ввод**  
 стандартный ввод или input.txt  
**Вывод**  
 стандартный вывод или output.txt  

Напишите программу, которая будет обрабатывать последовательность запросов таких видов:

- `CLEAR` — сделать очередь с приоритетами пустой (если в очереди уже были какие-то элементы, то удалить все).
- `ADD n` — добавить в очередь с приоритетами число `n` (вмещается в стандартный тип `int`).
- `EXTRACT` — вынуть из очереди с приоритетами максимальное значение. Следует изменить данные в памяти и вывести на экран найденное максимальное значение, или, если очередь была пустой, слово `CANNOT`.

---

### Формат ввода

Во входных данных записана произвольная последовательность запросов `CLEAR`, `ADD` и `EXTRACT` — каждый в отдельной строке.  
Суммарное количество всех запросов не превышает 200000.

---

### Формат вывода

Для каждого запроса типа `EXTRACT` выведите его результат в отдельной строке.

---

### Пример

**Ввод:**
```text
ADD 192168812
ADD 125
ADD 321
EXTRACT
EXTRACT
CLEAR
ADD 7
ADD 555
EXTRACT
EXTRACT
EXTRACT
```

**Вывод:**
```text
192168812
321
555
7
CANNOT
```
## Решение

main.cpp
```cpp
#include <iostream>
#include <vector>
#include <queue>

int main() {
    std::priority_queue<int> pq;
    std::string request;
    while (std::cin >> request) {
        if (request == "CLEAR") {
            pq = std::priority_queue<int>();
            continue;
        }

        if (request == "ADD") {
            int n;
            std::cin >> n;
            pq.push(n);
            continue;
        }

        if (request == "EXTRACT") {
            if (pq.empty()) {
                std::cout << "CANNOT\n";
                continue;
            }

            std::cout << pq.top() << '\n';
            pq.pop();
            continue;
        }
    }
    return 0;
} 
```
