# Акция магазина

**Ограничение времени:** 1 с  
**Ограничение памяти:** 64.0 Мб  
**Ввод:** стандартный ввод или `input.txt`  
**Вывод:** стандартный вывод или `output.txt`

Магазин проводит акцию: из списка предложений можно активировать **не более $ k $** скидок.  
Каждая скидка — целое число процентов $ a_i $ (может быть **отрицательной**, **нулевой** или **положительной**).

Необходимо выбрать **не более $ k $** скидок так, чтобы их **суммарное значение было максимально возможным**.

> Можно выбрать **меньше** $ k $ скидок, если это даёт большую сумму (например, если остальные — отрицательные).

---

## Формат входных данных

- Первая строка: два целых числа $ n $ и $ k $  
  ($ 1 \leq k \leq n \leq 2 \cdot 10^5 $) — количество предложений и максимум активируемых скидок.
- Вторая строка: $ n $ целых чисел $ a_1, a_2, \dots, a_n $  
  ($ -10^9 \leq a_i \leq 10^9 $) — величины скидок в процентах.

## Формат выходных данных

Выведите одно целое число — **максимальную возможную суммарную скидку**.

---

## Примеры

### Пример 1

**Ввод:**
```
7 3
5 10 -2 0 8 3 8
```

**Вывод:**
```
26
```

### Пример 2

**Ввод:**
```
5 2
4 -1 7 0 5
```

**Вывод:**
```
12
```
## Решение

main.cpp
```cpp
#include <iostream>
#include <queue>

int main() {
    int n, k;
    std::cin >> n >> k;
    std::priority_queue<int> pq;
    for (int i = 0; i < n; ++i) {
        int a;
        std::cin >> a;
        pq.push(a);
    }

    long long answer = 0;
    for (int i = 0; i < k && pq.top() > 0; ++i) {
        answer += pq.top();
        pq.pop();
    }

    std::cout << answer << '\n';

    return 0;
}
```
