# Камни

**Ограничение времени:** 1 с  
**Ограничение памяти:** 256.0 Мб  
**Ввод:** стандартный ввод или `input.txt`  
**Вывод:** стандартный вывод или `output.txt`

Вы играете в игру **"Камни"**: игру для двух игроков с двумя наборами камней — по $n$ и $m$ штук.  

С каждым ходом один игрок может:
- взять **один камень** из любого из двух наборов, **или**
- взять **по одному камню из обоих наборов** (всего два камня за ход).

Когда камень забрали, он выходит из игры.  
Побеждает игрок, который заберёт **последний камень**.  
**Первый ход за вами.**

Вы и ваш оппонент играете **оптимально**.

## Формат ввода

В первой строке содержатся два числа $n$ ($0 \leq n \leq 10$) и $m$ ($0 \leq m \leq 10$) — количество камней в первом и втором наборах соответственно.

## Формат вывода

В единственной строке выведите:
- `Lose`, если вы **заведомо проиграете** при оптимальной игре обоих сторон,
- `Win`, если у вас есть **выигрышная стратегия**.

## Примеры

### Пример 1

**Ввод:**
```
10 2
```

**Вывод:**
```
Lose
```

### Пример 2

**Ввод:**
```
4 5
```

**Вывод:**
```
Win
```

### Пример 3

**Ввод:**
```
6 8
```

**Вывод:**
```
Lose
```
## Решение

main.cpp
```cpp
#include <iostream>
#include <vector>
#include <algorithm>

template <typename T>
using row = std::vector<T>;

template <typename T>
using matrix = std::vector<row<T>>;

int main() {
    int n, m;
    std::cin >> n >> m;
    matrix<bool> field(n + 1, row<bool>(m + 1, false));
    for (int i = 1 ; i <= n; ++i) {
        field[i][0] = !field[i - 1][0];
    }

    for (int i = 1; i <= m; ++i) {
        field[0][i] = !field[0][i - 1];
    }

    for (int i = 1; i <= n; ++i) {
        for (int j = 1; j <= m; ++j) {
            field[i][j] = !std::min({field[i - 1][j], field[i -1][j - 1], field[i][j - 1]});
        }
    }

    std::cout << (field[n][m] ? "Win" : "Lose") << '\n';
    return 0;
}
```
