# Количество призов

**Ограничение времени:** 1 с  
**Ограничение памяти:** 256.0 Мб  
**Ввод:** стандартный ввод или `input.txt`  
**Вывод:** стандартный вывод или `output.txt`

Вы занимаетесь организацией соревнований для детей, и у вас есть $n$ конфет, которые вы раздадите в качестве призов.  
Вы хотите отдать эти конфеты тем, кто займет первые $k$ мест, **распределив их так**, чтобы:

- каждый получил **целое положительное** число конфет,
- **все полученные количества были различны**,
- **чем выше место — тем больше конфет**.

Чтобы порадовать как можно больше детей, найдите **максимальное возможное значение $k$**, при котором это возможно.

> Другими словами: найдите наибольшее $k$, такое что  
> $n = a_1 + a_2 + \dots + a_k$, где $1 \leq a_1 < a_2 < \dots < a_k$ — целые числа.

> Минимальная сумма для $k$ различных положительных целых чисел — это $1 + 2 + \dots + k = \frac{k(k+1)}{2}$.

## Формат ввода

Целое число $n$ ($1 \leq n \leq 10^9$).

## Формат вывода

Единственная строка: максимальное число $k$, при котором $n$ можно представить как сумму $k$ различных положительных целых чисел.

## Примеры

### Пример 1

**Ввод:**
```
6
```

**Вывод:**
```
3
```

> $6 = 1 + 2 + 3$

### Пример 2

**Ввод:**
```
8
```

**Вывод:**
```
3
```

### Пример 3

**Ввод:**
```
2
```

**Вывод:**
```
1
```

## Решение

main.cpp
```cpp
#include <iostream>
#include <vector>


int main() {
    int n;
    std::cin >> n;
    std::vector<int> answer;
    int k = 1;
    while (n >= k) {
        answer.push_back(k);
        n -= k;
        ++k;
    }

    answer.back() += n;
    n = 0;

    std::cout << answer.size() << '\n';

    return 0;
}
```
