# Разбиение Ломуто

**Ограничение времени:** 1 с  
**Ограничение памяти:** 256.0 Мб  
**Ввод:** стандартный ввод или `input.txt`  
**Вывод:** стандартный вывод или `output.txt`

Постройте **разбиение Ломуто** относительно **первого элемента** массива.

Разбиение Ломуто — это шаг алгоритма быстрой сортировки, при котором:
- Выбирается **опорный элемент** (в данной задаче — первый элемент массива).
- Массив перестраивается так, чтобы:
  - Все элементы, **меньшие или равные** опорному, оказались **слева** от некоторой позиции.
  - Все элементы, **строго большие** опорного, оказались **справа**.
- В конце опорный элемент помещается на своё **окончательное место** (границу между двумя частями).

> В реализации Ломуто обычно используется один указатель, проходящий по массиву, и поддерживается инвариант: элементы до некоторого индекса `i` — ≤ опорного.

В этой задаче требуется вывести массив **после одного шага разбиения Ломуто**, где опорный элемент — **первый** в исходном массиве.

## Формат ввода

- В первой строке задано число $n$ ($1 \leq n \leq 100\,000$).
- Во второй строке задано $n$ целых чисел $a_i$ ($1 \leq a_i \leq 10^9$).

## Формат вывода

Выведите массив после выполнения разбиения Ломуто относительно первого элемента.

## Примеры

### Пример 1

**Ввод:**
```
9
4 7 2 5 3 1 8 9 6
```

**Вывод:**
```
1 2 3 4 7 5 8 9 6
```

### Пример 2

**Ввод:**
```
4
3 4 7 17
```

**Вывод:**
```
3 4 7 17
```

### Пример 3

**Ввод:**
```
5
1 3 2 9 10
```

**Вывод:**
```
1 3 2 9 10
```
## Решение

main.cpp
```cpp
#include <iostream>
#include <vector>

void LomutoPartition(std::vector<int> & vec, size_t delimeterIndex) {
    std::vector<int> vecSmall, vecLarge;
    for (size_t i = 0; i < vec.size(); ++i) {
        if (i == delimeterIndex) {
            continue;
        }

        if (vec[i] <= vec[delimeterIndex]) {
            vecSmall.push_back(vec[i]);
        } else {
            vecLarge.push_back(vec[i]);
        }
    }

    int delimeter = vec[delimeterIndex];
    for (size_t i = 0; i < vecSmall.size(); ++i) {
        vec[i] = vecSmall[i];
    }
    size_t curIndex = vecSmall.size();
    vec[delimeterIndex] = delimeter;
    ++curIndex;
    for (size_t i = 0; i < vecLarge.size(); ++i) {
        vec[curIndex + i] = vecLarge[i];
    }

    return;
}

int main() {
    int n;
    std::cin >> n;
    std::vector<int> vec(n);
    for (int i = 0; i < n; ++i) {
        std::cin >> vec[i];
    }

    LomutoPartition(vec, 0);

    for (int i = 0; i < n; ++i) {
        if (i > 0) std::cout << ' ';
        std::cout << vec[i];
    }
    std::cout << '\n';

    return 0;
}
```
